{
  "category": "culture",
  "articles": [
    {
      "id": 1,
      "title": "Quiz of the Year 2025, Part 1: Which star teased her engagement on the red carpet?",
      "link": "https://www.bbc.com/news/articles/ce8n1l5vd5xo",
      "content": "In the first three months of the year, deadly wildfires tore through Los Angeles, outgoing US President Joe Biden handed over the keys to the White House, and actress Millie Bobby Brown hit back at \"bullying\" journalists .\nBut how much attention did you pay to what else happened in the world?\nTest your memory of January to March in part one of our four-part Christmas quiz - 52 questions for 52 weeks of the year.\nQuiz compiled by Ben Fell .\nFancy some more? Have a go at something from the archives ."
    },
    {
      "id": 2,
      "title": "Christmas spirit offered 'right through the year'",
      "link": "https://www.bbc.com/news/articles/c20kjvk3emeo",
      "content": "A charity which supports vulnerable people in Jersey says it has \"the Christmas spirit right through the year\".\nThe Grace Trust which helps between 700 to 750 people a year struggling with poverty, loneliness or addiction issues said it was seeing \"a much wider range\" of people from all layers of society, including more older people needing community support.\nGeneral manager Vinni Jones said the charity aimed to put a smile on people's faces from its drop-in base at Lewis Street in St Helier.\nIt helped 500 people at the food bank every year and also ran singing, art and Saturday lunches.\nHe said there were extra festive goodies at the food bank and 92 people recently sat down to an \"absolutely brilliant\" Christmas meal at St Paul's Centre with 20 volunteers on hand to help out.\nEntertainment was provided by Fiddler's Green and the trust's Parklife choir.\nMr Jones said they saw more people at Christmas because it can be a challenging time.\n\"Just come down, knock on the window and we'll give you what we've got.\"\nHe explained that \"we can offer a lot more than simply the food and Christmas goodies\" and said people are often surprised at all the activities on offer and encouraged them to have a go.\nHe said the charity also had a fund to help younger mums and links with other agencies so it can offer toy vouchers at Christmas.\nSupport was also available year round for struggling islanders.\n\"It's just a matter of being able to offer that understanding and to talk about January, talk about February for them. We'll still be here for you,\" Mr Jones said.\nThe government has also reminded islanders about mental health support over Christmas.\nThere is  24 hour support available from the Adult Mental Health crisis team,  on 445 290 and online support from Together All.\nFollow BBC Jersey on X and Facebook . Send your story ideas to channel.islands@bbc.co.uk ."
    },
    {
      "id": 3,
      "title": "Jethro Tull founding member dies aged 82",
      "link": "https://www.bbc.com/news/articles/c8jwdwpgmm8o",
      "content": "Mick Abrahams, a founding member of rock band Jethro Tull, has died at the age of 82.\nPosting on the band's official website , lead singer Ian Anderson said he was sorry to hear of the death of the \"strong vocalist and experienced, powerful and lyrical guitarist\".\nHe said Luton-born Abrahams had \"endured worsening ill health for the last 15 years, leaving him finally unable to perform\".\nAnderson said Abrahams was \"vitally important\" to the band's early line-up and developed his musical ideas into a \"tour de force display of his instrumental talents for the rest of his performing days\".\nJethro Tull were formed \"out of the ashes\" of The John Evan Band and McGregor's Engine, the blues band Abrahams formed with Clive Bunker in the Luton/Dunstable area, said Anderson.\nAbrahams played on Tull's first album, This Was, but left shortly after it was finished, and went on to found another successful band, Blodwyn Pig.\nAfter pursuing a solo career between 1971 and 2017, he retired from performing following a stroke.\nAnderson described him as a \"homebody\" who \"liked to gig around the home counties\".\nHe said: \"We all offer our condolences to Mick's family and close friends, who can feel justifiably proud of his achievements and musical legacy.\"\nFollow Beds, Herts and Bucks news on BBC Sounds , Facebook , Instagram and X ."
    },
    {
      "id": 4,
      "title": "The travel images that transported us in 2025",
      "link": "https://www.bbc.com/travel/article/20251223-the-travel-images-that-transported-us-in-2025",
      "content": "From a secluded valley in Uzbekistan to a sacred Canadian island you can see but not touch, these images captivated BBC.com's photo editors this year.\nA great travel photograph can captivate us, stir us and reveal far-flung corners of the globe we didn't know existed. They not only offer us an escape, but also a glimpse of the many people, places and cultures that make the world so wondrously diverse.\nThis past year, BBC.com's visual editors have collaborated with some amazing photographers to see the world through their lenses. From monk-led travel experiences in Laos to a mesmerising firefly display in North Carolina, here are some of the images that stayed with us in 2025.\n\"Overtourism remains an important issue, and these images show the contrast between maintaining Laos' unique traditions and commodifying it through mass tourism. As a traveller, the best etiquette is to respect cultures during your stay, and these photos make me hopeful that it's possible to find that middle ground between immersing yourself in a place and unwittingly harming it.\" – Yun Sun Park\n\"These images provide a glimpse of the sheer size of Mexico City's food market. I'm in awe of the business that goes on to exchange over 30,000 tons of produce stored in warehouses into the hands of half a million customers every day. Food is one of the things that brings people together and the photos here show the connection between everyday farmers and high-end restaurants. It's a testament to how sticking to your craft leads you to become a sought-out expert in your field.\" – Yun Sun Park\n\"The image of the woman weaving silk has a depth that emphasises the history behind the traditional art form. I'd love to munch on the platter of snacks that was freshly picked and prepared here. These are elements that encompass what travel is to me.\" – Yun Sun Park\n\"Marcel Heinjnen's images evoke a sense of whimsy that reminded me of some distant forgotten childhood films. I'm completely taken by the photographer's ability to humanise these subjects. Each cat playfully participates with the camera, just as they do within their communities, truly achieving storytelling through the lens. This achieved intimacy with the subjects doesn't make the cats seem out of place, which adds an incredible layer to this story about Istanbul's 'modern-day street guardians'.\" – Serenity Strull\n\"From his trek in the Canadian Rockies, BBC writer and editor Eliot Stein described Spirit Island as 'mythical'. The lead image from Jake Graham captures this otherworldly landscape and truly illustrates the headline's powerful impact – showing you a haven you can see but not touch. The glassy water of Maligne Lake immediately struck me, completely unblemished and perfectly reflecting the towering mountains and sharp foliage. The images aren't just technical accomplishments, they also lift and enhance the story's by capturing the sanctity of this small island protected by the Stoney First Nation. But what I found the most compelling about the first photograph was the emotional impact it elicits. As you take in the composition, the entire scene feels like a deep breath, and one that'll make you feel convicted in upholding the island's protections and isolation.\" – Serenity Strull\n\"Photographer Ernesto Roman takes us through the streets of Chinatown in New York City, his adopted home. Restaurants, street food carts at night and close-ups of succulent Cantonese foods showcase the neighbourhood's rich and diverse culinary offerings. Calvin Eng, known for his reinterpretation of Cantonese cuisine, is photographed by Roman, looking proud in the streets of Chinatown, where he takes us to his favourite places.\" – Javier Hirschfeld\n\"Ryan Silver's stylish photographs evoke a sense of glamour and were one of my favourite shoots I worked on this year. An elegant cocktail bar is the background for Silver's portrait of award-winning director Paul Feig, known nearly as much for his films and his love for cocktails. From one of his preferred cocktail bars in Los Angeles, the always-classy Feig takes us around the world to his favourite bars in London, Capri and New York.\" – Javier Hirshfeld\n\"I also loved working with writer Andrea Carlo and photographer Maurizio Fiorino on this article on the little-known tradition of Jewish food in Rome – which is home to one of Europe's oldest Jewish communities. Jewish food in the Italian capital dates back to 2nd Century BCE, and was influenced by waves of newly arrived Sephardic Jews who were exiled from Spain and Portugal in the 15th and 16th Centuries. Fiorino's portraits introduce us to Ruben Bondi in Rome, influencer chef and member of the city's Jewish community; he also captured dishes like carciofi alla giudia – images inviting us to travel to Rome for artichokes and other rich dishes featured in the article.\" – Javier Hirshfeld\n\"Glastonbury is, for most readers, synonymous with music, mud and revellry during the British summer. This story led us to discover the more spiritual side of the town beyond the famous music festival, through the eyes of Rollo Maughfling, pioneer of a modern Druidic revival in the town. Photographer Fran Gomez de Villaboa masterfully captures the spirit of Glastonbury and of the druid, as in this scenic portrait of Rollo by the sacred springs.\" – Javier Hirshfeld\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 5,
      "title": "Theatre breaks box office record after £3.5m revamp",
      "link": "https://www.bbc.com/news/articles/ce91eyyy53jo",
      "content": "A theatre that underwent a £3.5m refurbishment has broken its box office record since reopening, a council said.\nIpswich Regent, the biggest venue of its kind in East Anglia , saw its bar areas and accessibility improved, with the Art Deco frontage restored.\nThe theatre, which opened as the Gaumont in November 1929, has hosted acts including The Beatles, Rolling Stones, Buddy Holly, Dolly Parton, Tina Turner, Little Mix, Girls Aloud and The Darkness.\nIt reopened in November and Ipswich borough councillor Jane Riley said audiences had flocked back to see the pantomime production of Cinderella.\n\"The 2025 festive panto Cinderella has been the perfect production for celebrating the curtains coming up once again at the Ipswich Regent Theatre, and we've already broken the box office record,” she said.\n\"The energy in the theatre is magical, and we're delighted to be welcoming audiences back into our beautiful venue.\"\nThe seven-month project also saw the lounge and foyer areas refurnished, a new staff office and toilet block introduced, with accessibility upgrades including a new lift access and improved ramped access.\nThe project included Ipswich-based firms KLH Architects, Johns Slater and Haward and Mixbrow Construction, based in nearby Needham Market.\nSuffolk brewer Adnams said the 1,500-capacity theatre features the \"longest bar we've ever created\".\n“This project has not only modernised facilities and improved accessibility but also restored the original Art Deco features that make the Regent such an iconic cultural asset,” said Riley.\n\"Together with our theatres team, the dedication of everyone involved in retaining the spirit of the Regent Theatre and its place in the heart of Ipswich has been inspiring.”\nThe theatre is owned by Ipswich Borough Council, with the project funded by a levy on ticket prices .\nFollow Suffolk news on BBC Sounds , Facebook , Instagram and X ."
    },
    {
      "id": 6,
      "title": "Busking in London 'slowly becoming non-existent'",
      "link": "https://www.bbc.com/news/articles/c0je3d5gej4o",
      "content": "Busking in central London is \"slowly becoming non-existent\", a musician has said, amid a warning that the loss of established performance pitches is forcing some some to give up their careers and is damaging the capital's cultural life.\nIn Trafalgar Square, the only designated busking pitch is currently unavailable because it is covered by the Christmas market.\nThe Musicians' Union said it had been campaigning for performers to be accommodated alongside the seasonal stalls.\nWestminster Council said it recognised the value of street performance but had to balance competing interests.\nMusician Serena Kaos said she had stopped working as a full-time performer after losing access to regular busking locations.\n\"It's a huge, huge cultural loss for not just the current musicians, but the musicians of the future, especially working-class ones that used to have this as one of the few possibilities of getting inside the craft,\" she said.\nSimeon Scheuber-Rush, the union's London regional officer, said the closure had left amplified performers without a viable space.\n\"We've got the lovely Christmas market and unfortunately that Christmas market hasn't incorporated the busking pitch,\" he said.\n\"It has closed it as well. So we've now been left with a situation where there are no viable busking pitches for amplified busking.\"\nMs Kaos added that busking is \"such an important part\" of London's culture but that it is \"slowly becoming non-existent\".\nThe situation follows a court ruling affecting Leicester Square, previously one of the capital's busiest live music spots.\nAfter a legal battle involving Global Radio and Westminster City Council, a judge ruled earlier this year that amplified busking in the square amounted to a public nuisance, comparing it to psychological torture.\nWestminster Council subsequently suspended all public busking in the area.\nMr Scheuber-Rush said the decision had been keenly felt by performers and the public.\n\"We've been campaigning in Leicester Square and members of the public have been so distraught really at the sort of cultural vandalism of the busking being banned in the square,\" he said.\n\"They really miss it.\"\nA council spokesperson said they have tried to make sure visitors, businesses and buskers \"get the best from our city\"  and that \"street performers and busking is one of many reasons why Westminster is culturally rich\".\n\"We will always promote opportunities for licensed street entertainers across Westminster that minimise disruption but still allow performances to go ahead,\" they added.\nThe Trafalgar Square pitch is expected to reopen in January, but there is no such guarantee for Leicester Square.\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook , X and Instagram . Send your story ideas to hello.bbclondon@bbc.co.uk"
    },
    {
      "id": 7,
      "title": "The carol of peace based on a Biblical massacre",
      "link": "https://www.bbc.com/news/articles/cwyg2lgw14xo",
      "content": "On Christmas Day 85 years ago, just weeks after the devastation of the Coventry Blitz, a small group gathered in the shattered shell of the city's cathedral for a service broadcast live to the nation.\nSix weeks earlier, on 14 November 1940, German bombers had dropped hundreds of tons of explosives and incendiaries, destroying much of the city and its medieval cathedral.\nDespite the devastation, Provost Richard Howard addressed the Empire from the ruins, speaking of forgiveness and hope, calling for the country to \"banish hopes of revenge\".\nThe service concluded with the choir singing the Coventry Carol, music as old as the cathedral itself, and a song which now exists alongside it as a symbol of peace and reconciliation born from tragedy.\nThe Coventry Carol is not \"what you would call a normal carol,\" explained amateur city historian Malvern Carvell.\nHe has contributed to a new podcast, examining the origins of the piece, which was not initially associated with Christmas, he said.\nThe music was first performed in the city's Mystery Plays - medieval religious dramas based on Bible stories.\nThe story depicts the Massacre of the Innocents from the Gospel of Matthew , he explained.\nLully, lullay, thou little tiny child.\nBye bye, lully, lullay , the carol begins.\nIts lyrics imagine \"terrified mothers singing a haunting lullaby\" to hide their babies from the swords of King Herod's soldiers who had been ordered to murder all male infants.\n\"They are saying quiet, quiet please, don't make a noise, Herod's men are coming to kill you,\" Mr Carvell said.\n\"It's fear, the carol is pure fear, he added.\n\"It's not your normal Christmas cheer.\"\nNow a Christmas staple, covered by artists from Annie Lennox to US singer-songwriter Sufjan Stevens, the piece was first performed in Coventry's pageants, dating back to the 14th Century and involving stories surrounding Christ's life.\nIt was part of a play performed by the city's Guild of Shearmen and Taylors, with the first written record dating from 1534.\nThis copy, kept at the Library of Birmingham, was destroyed in a fire, but another record survived, he said, and by the late 1800s there was a move to revive it.\n\"I think possibly as a consequence of the fire the plays started to be better known again,\" Mr Carvell said.\n\"It then began to move into the public consciousness and became more well-known outside the city.\"\nThere is even speculation that Shakespeare may have witnessed the original performances in the late 16th Century.\nThe link between Coventry and the biblical story of Herod's infanticide also found its way into modern popular culture.\nIn the 2009 film Nativity!, set in the city, rival schools compete to stage the ultimate Christmas play.\nOne ambitious teacher, Gordon Shakespeare, played by Jason Watkins, opts for a primary school production of the Massacre of the Innocents.\nThe scene sees young pupils pull long red ribbons from a doll, symbolising blood, before tossing the baby dramatically into the lap of a visiting critic, played by Alan Carr.\nDirector Debbie Isitt said the scene was one of her favourites in the film.\n\"It seemed so fitting for the story that Gordon with his dark, ominous, competitive streak should wish to create a play that focussed on the most disturbing of subjects - the Massacre of the Innocents,\" she said.\nThe character's inspiration was to \"outdo the traditional school nativity and grab the attention of the critics and Hollywood,\" she added.\n\"The connection with the Coventry Carol and Coventry Cathedral made perfect sense and certainly inspired the moment in the film.\"\nBBC Russia Editor Steve Rosenberg has recorded a version of the carol this year with cellist and Channel 4 News presenter Ciaran Jenkins.\nTheir annual long-distance Christmas collaborations are broadcast on the BBC and Channel 4 as well as being shared on social media.\n\"The Coventry Carol was Ciaran's idea - and I happily agreed - it's a beautiful piece of music,\" said Steve.\n\"I heard Coventry Carol for the first time aged 18 and fell I love with it immediately. I was in a choir with a fantastic group of people who would go on to become friends for life,\" added Ciaran.\n\"We performed a little carol concert each year at a small rural church - it was incredibly idyllic: the scent of mulled wine, the flicker of candlelight, an audience glowing with goodwill. It was a very happy time.\"\nIn the podcast Hark! Rev Kate Massey, the cathedral's minister for arts and reconciliation, said the carol echoed the city's spiritual power.\n\"There is something incredibly intimate about it, this mother singing to her child, the way parents and carers do when things are difficult.\n\"They can't stop the bad things happening, but they can be there to hold them,\" she said.\nShe said Jesus was \"born into a time of occupation, a time when his peers were at risk of violence\".\n\"What breaks my heart even more about this carol is there are fathers and mothers and aunts and godparents around the world today who are soothing their children who are hungry, who are living through conflicts, who can't keep them safe from the world's dangers but still are loving them and comforting them,\" she added.\n\"I think it's an incredibly powerful carol from that point of view.\n\"The carol, for all of its melancholy, for all of its challenging grim material within the lyrics, it has that poignant beauty and again it sustains our soul, as all beauty does.\"\nNativity! is available to watch on BBC iPlayer.\nFollow BBC Coventry & Warwickshire on BBC Sounds , Facebook , X and Instagram ."
    },
    {
      "id": 8,
      "title": "Wicked make-up artists reveal challenge of Elphaba's green look",
      "link": "https://www.bbc.com/news/articles/cwyx9n69922o",
      "content": "Two make-up artists who spent three hours transforming Cynthia Erivo into a green Elphaba for the Wicked films said it was a challenge to ensure the make-up looked \"natural\" on set.\nAlice Jones and Olivia Jerrard worked on the movies Wicked and Wicked: For Good, parts of which were filmed in Sky Studios Elstree in Borehamwood, Hertfordshire, and Ivinghoe, Buckinghamshire, from December 2022 to January 2024.\nElphaba's green complexion was made famous by Margaret Hamilton's portrayal of the Wicked Witch of the West in the 1939 film The Wizard of Oz.\nMs Jones, 33, from Beaconsfield, Buckinghamshire, said: \"On the first day she's [Erivo] on this bright pink set. Everything is pink but Cynthia. I turned to Olivia and said she looks so green… is this too green?\"\nDuring filming, the pair's day began at 03:00 to arrive on set in time to begin the process of transforming Erivo.\nThey said the task involved covering up the actor's tattoos and piercings, then layering and airbrushing different tones of green and painting her body.\nWith Erivo's make-up, prosthetics, wig and nails all needing to be applied at the same time, the pair described the process as a game of \"twister\".\nMs Jones said: \"For part one we wanted Cynthia [Erivo] to have that real kind of bright-eyed innocence.\n\"For part two, the story itself is much darker. Her character journey, she is in a much darker place, she is also in a more powerful place and she's more mature.\n\"All that darkness in the make-up helped reflect her power, darkness and maturity.\"\nMs Jerrard, 32, from Marlow, Buckinghamshire, said: \"Cynthia [Erivo] has 25 piercings in her ears so they all needed to be concealed for filming… as far as taking them out and putting them back in every day it was too fiddly a process.\n\"I have applied loads of ears and prosthetics but I have never applied them on top of piercings,\" she said.\nWhile the role of Elphaba has been played for decades in the stage production, Ms Jones said Erivo made the character \"iconic in her own right\".\nShe said: \"There are things she created for this character that hadn't been done before like the micro braided wig and the epic nails.\"\n\"On set it can be very serious… there's a lot at stake for a lot of departments.\n\"You don't want to waste time, you don't want to hold camera up, you don't want to be holding Cynthia's performance up,\" Ms Jerrard added.\nAfter training as a make-up artist 13 years ago, Ms Jones said she was asked to join the team for Wicked after working with Erivo on an independent film in Greece.\nMs Jerrard said she was doing tests for the munchkin characters when she was asked to work on prosthetics for the film.\nMs Jones said: \"The really big Hollywood movies seemed to still be a Hollywood dream. Whereas now, so many of them are filmed around London, we are so lucky that so many [movies] have come across from America.\"\nMs Jones added: \"Ivinghoe was incredible how they transformed this farm into Munchkinland, the Emerald City, Shiz University… Emerald City went up so quickly. One minute it wasn't there and then it was.\n\"When we broke for the strikes we hadn't even shot Defying Gravity… it was really nice to come back after strikes having that to look forward to.\"\nMs Gerrard said the fans' reaction to the film has been rewarding.\nShe said: \"The sacrifice is so big for people who work in film. We sacrifice so many hours, we give so much up… it's not just that you're watching a film and getting the recognition for just the art, you get it more for the sacrifice.\n\"You feel more emotional about that element.\"\nFollow Beds, Herts and Bucks news on BBC Sounds , Facebook , Instagram and X ."
    },
    {
      "id": 9,
      "title": "'Song makes Noddy avoid restaurants at Christmas'",
      "link": "https://www.bbc.com/news/articles/ckgkpwzdej0o",
      "content": "Singer Noddy Holder avoids going to restaurants on Christmas Day because of how often his famous festive song is played, his wife has said.\nSuzan Holder said she and the Walsall-born rocker would find it \"a bit awkward\" if Slade's hit Merry Xmas Everybody came on when they were out eating.\n\"The Christmas song will be put on and every single person in the restaurant will turn and look,\" she told BBC Radio WM.\nThe track was first released in December 1973 by the Wolverhampton band but has become a mainstay on festive playlists, often re-entering the UK singles chart in the run-up to Christmas.\nMrs Holder said her husband usually wakes her up on Christmas morning by singing his famous \"It's Christmas\" line from the song.\n\"I do think people think he does it every day but I am only talking about Christmas morning itself,\" she added.\n\"As the man who coined the phrase, I think that's absolutely acceptable.\"\nAmong his festive traditions, Mrs Holder said he made a \"rather mean Christmas dinner\" and his roast potatoes \"had to be eaten to be believed\".\nHolder, who now lives in Cheshire, fronted Slade for 26 years until he stepped down in 1992.\nThey are often named among the most successful British bands of the 1970s, with other hit singles including Cum On Feel The Noize and Coz I Luv You.\nHolder, 79, was diagnosed with oesophageal cancer in 2018 and was initially given six months to live but he recovered following care at The Christie hospital in Manchester.\nLast December, the singer revealed he had started to perform again and had been playing with a 10-piece boogie jazz band since his recovery.\nFollow BBC Birmingham on BBC Sounds , Facebook , X and Instagram ."
    }
  ]
}