{
  "category": "news",
  "articles": [
    {
      "id": 1,
      "title": "Quiz of the Year 2025, Part 1: Which star teased her engagement on the red carpet?",
      "link": "https://www.bbc.com/news/articles/ce8n1l5vd5xo",
      "content": "In the first three months of the year, deadly wildfires tore through Los Angeles, outgoing US President Joe Biden handed over the keys to the White House, and actress Millie Bobby Brown hit back at \"bullying\" journalists .\nBut how much attention did you pay to what else happened in the world?\nTest your memory of January to March in part one of our four-part Christmas quiz - 52 questions for 52 weeks of the year.\nQuiz compiled by Ben Fell .\nFancy some more? Have a go at something from the archives ."
    },
    {
      "id": 2,
      "title": "Officials discover a million more documents potentially related to Epstein case",
      "link": "https://www.bbc.com/news/articles/czdgz84dn35o",
      "content": "US authorities have discovered more than a million more documents potentially related to the late paedophile Jeffrey Epstein that they plan to release in the coming days and weeks, officials say.\nThe FBI and federal prosecutors in New York informed the Department of Justice (DoJ) of the discovery.\n\"We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible,\" the DoJ said on Wednesday.\nThe department said it could take \"a few more weeks\" before all the files are released. The DoJ has been under scrutiny after not releasing all Epstein files by 19 December, the deadline mandated under a new law.\nThe agency said it would \"continue to fully comply with federal law and President Trump's direction to release the files\".\nThe statement did not specify how the FBI and the US Attorney for the Southern District of New York came across the additional material. Epstein had been facing charges of sex trafficking minors in the state when he died awaiting trial in a New York prison.\nThe news comes after the justice department released thousands of documents - some heavily redacted - related to their investigations into Epstein.\nThe department has been releasing the documents in batches and top officials have said hundreds of thousands of documents still are to be released.\nThe files were released after Congress passed the Epstein Files Transparency Act - signed into law by US President Donald Trump - that ordered the agency to share all the documents with the public while protecting victims' identities.\nMany of the released documents, which include videos, photos, emails and investigative documents, have heavy redactions, including names of people the FBI appears to cite as possible co-conspirators in the Epstein case.\nThe justice department has faced criticism from lawmakers on both sides of the aisle over the amount of redactions, which the law permits only to protect victims' identities and active criminal investigations.\nIn a post on X after the discovery of the additional documents was announced, the top Democrat on the House Oversight Committee, a congressional panel that has been investigating the Epstein saga, accused the White House of “illegally” withholding the files.\n“Every day we see lies, incompetence, missed deadlines, and illegal redactions,” Representative Robert Garcia said in a statement.\nThe law passed by Congress and signed last month by Trump states that names and information that might be embarrassing or cause \"reputational harm\" are not allowed to be redacted.\nIt specifically asks the DoJ for internal communications and memos detailing who was investigated and decisions on whether \"to charge, not charge, investigate, or decline to investigate Epstein or his associates\".\nIncluded in the documents are emails appearing to be exchanged between FBI personnel in 2019 that mention 10 possible \"co-conspirators\" of Epstein .\nThe emails said six of the group had been served with subpoenas. This included three in Florida, one in Boston, one in New York City, and one in Connecticut.\nPossible co-conspirators in Epstein's crimes are a major focus for his victims, and for several lawmakers who have demanded more transparency from the justice department.\nPrevious releases of Epstein documents have included revelations that reverberated across the Atlantic.\nPeter Mandelson was sacked as the UK's ambassador to the US after details emerged about his friendship with the convicted paedophile, and that he told Epstein \"I think the world of you\", the day before Epstein began his sentence for soliciting prostitution from a minor in June 2008.\nLord Mandelson said in a letter to staff that \"I deeply regret\" the circumstances of his departure from the British embassy in Washington DC. He said being ambassador had been \"the privilege of my life\" and he continued \"to feel utterly awful about my association with Epstein twenty years ago and the plight of his victims\".\nIn October, Andrew Mountbatten-Windsor lost his prince title and was asked to leave his Windsor mansion, Royal Lodge, following prolonged scrutiny over his links to Epstein.\nIn the latest release of files on Tuesday, a 2001 email sent by a person identified as \"A\" from \"Balmoral\" to Epstein's accomplice and close associate Ghislaine Maxwell - who was sentenced to 20 years in prison in 2022 for sex trafficking of minors and other offences- asks: \"Have you found me some new inappropriate friends?\"\nThe BBC has contacted Andrew's team for a response. He has repeatedly denied wrongdoing, and said he did not \"see, witness or suspect any behaviour of the sort that subsequently led to his [Epstein's] arrest and conviction\"."
    },
    {
      "id": 3,
      "title": "King's Christmas message urges unity in divided world",
      "link": "https://www.bbc.com/news/articles/ce86x326y08o",
      "content": "The King's Christmas message has invoked the wartime spirit, calling on communities to pull together in an increasingly divided world and urging people to get \"to know our neighbours\".\nHis traditional speech, recorded in Westminster Abbey, remembered this year's 80th anniversaries of VE Day and VJ Day and said we should \"never lose sight\" of the values in which \"communities came together in the face of such great challenge\".\nThe King, speaking in the abbey's medieval Lady Chapel, also hailed the \"spontaneous bravery\" of those who helped in emergencies, such as the Bondi Beach attack in Australia.\nA Ukrainian choir sang a carol, with many of the group's singers in the UK because of the war.\nThe speech included a call for quiet and calm as \"our world seems to spin ever faster\", with King Charles quoting poet TS Eliot's words about finding the \"still point of the turning world\".\nA royal aide said this was a reference to the social impact of new technologies on communities, and that people might consider a \"digital detox\".\nFor the second year, the message was delivered in a location away from a royal palace, the King using a chapel in the abbey to talk about life's \"pilgrimage\" and the lessons for current times.\nIn front of Christmas trees originally used for the Princess of Wales's carol concert at the Abbey, he spoke of the importance of community cohesion and bridging divides.\n\"As I meet people of different faiths, I find it enormously encouraging to hear how much we have in common,\" said the King, speaking under the chapel's famous vaulted ceiling.\n\"With the great diversity of our communities we can find the strength to ensure that right triumphs over wrong.\"\nHe praised the wartime generation's \"courage and sacrifice\" and their togetherness in the face of adversity, with the broadcast showing pictures of this year's commemorations marking 80 years since the end of World War Two in Europe and the Far East .\n\"These are the values which have shaped our country.\n\"As we hear of division, both at home and abroad, they are the values of which we must never lose sight,\" said the King.\nThere was praise too for the heroic actions of those caught up in violent incidents.\n\"Individuals and communities have displayed spontaneous bravery, instinctively placing themselves in harm's way to defend others,\" said the King.\nHis speech was accompanied by images from Bondi Beach in Australia, where earlier this month bystanders intervened against a gun attack on a Jewish community event.\nThere were also pictures of the King at a synagogue in Manchester , where he met members of the congregation who had tried to stop an attacker.\nAs an example of building bridges between religious leaders, the broadcast showed this year's state visit to the Vatican, with the King speaking of the \"historic moment of spiritual unity\" when he prayed with Pope Leo .\nThe King reflected on the Christmas story, describing Jesus, Mary and Joseph as a \"homeless\" family, and saying their message was about \"peace and reconciliation\" and represented a \"prayer for our times\".\nIt was a Christmas message that did not dwell on any of the King's personal challenges.\nThere was no reference to his health, after he recently recorded a video message saying there was \"good news\" that his cancer treatment would be reduced next year.\nThere were no references to his brother Andrew Mountbatten-Windsor, who was stripped of his titles this year, in the speech.\nThe accompanying film focused on the working royals, including Prince William and Catherine.\nThere were pictures of Prince George on his first visit to the Passage homelessness charity, where he went with his father Prince William last week.\nThe King has been a strong supporter of Ukraine since Russia's invasion and there was a symbolic sign of this with the broadcast including the Carol of the Bells, a Ukrainian carol sung by the Songs for Ukraine Chorus.\nMany members of the choir are in the UK because of the war in Ukraine.\nEarlier, the King led the Royals in celebrating the high point of the festive season with a service of Christmas carols and prayers at St Mary Magdalene Church on Charles's private Sandringham Estate in Norfolk.\nAfter the service at St Mary Magdalene Church in Norfolk, the royals greeted and interacted with excited crowds who had gathered on the crisp Christmas morning.\nSign up here to get the latest royal stories and analysis every week with our Royal Watch newsletter. Those outside the UK can sign up here ."
    },
    {
      "id": 4,
      "title": "We invited a man into our home at Christmas and he stayed with us for 45 years",
      "link": "https://www.bbc.com/news/articles/cdxwllqz1l0o",
      "content": "Christmas is often regarded as a time for goodwill, but one young UK couple's act of kindness 50 years ago changed their lives forever.\nOn 23 December 1975, Rob Parsons and his wife Dianne were preparing for Christmas at their Cardiff home when they heard a knock at the door.\nOn their doorstep stood a man with a bin bag containing his possessions in his right hand and a frozen chicken in his left.\nRob studied the man's face and vaguely remembered him as Ronnie Lockwood, someone he would occasionally see at Sunday School as a boy and who he was told to be kind to as he was a \"bit different\".\n\"I said 'Ronnie, what's with the chicken?' He said 'somebody gave it to me for Christmas'. And then I said two words that changed all of our lives.\n\"And I'm not exactly sure why I said them. I said come in.\"\nAged just 27 and 26 years old at the time, the couple felt compelled to take Ronnie, who was autistic, under their wing.\nThey cooked his chicken, let him bathe and agreed to let him stay for Christmas.\nWhat began as an act of compassion turned into an unique companionship of love and compromise that lasted 45 years, until the day Ronnie died.\nRob, now 77, and Dianne, now 76, had only been married for four years when they welcomed Ronnie into their home.\nRonnie was then almost 30 and had been without a home from the age of 15, living in and around Cardiff and moving from job to job - Rob would sometimes see him at a youth club he ran.\nTo make him feel as welcome as possible, they asked their family to bring him a gift for Christmas, anything from a pair of socks to some \"smellies\".\n\"I can remember him now. He was sat at the Christmas table and he had these presents and he cried because he'd never known that sort of feeling of love, you know,\" said Dianne.\n\"It was incredible, really, to watch.\"\nThe pair planned to let him stay until the day after Christmas, but when the day came, they couldn't bring themselves to cast Ronnie out and sought advice from the authorities.\nThe homeless centre told them Ronnie needed an address to get a job, Rob said, but \"to get an address, you need a job\".\n\"That's the Catch 22 that loads of homeless people are in.\"\nPut in a care home when he was just eight years old, Ronnie disappeared from Cardiff aged 11, said Rob, and it was only when he was researching for his book, A Knock on the Door, did he discover what happened to him.\nHe had been sent 200 miles away to a school which was referred to in a report as a \"school for subnormal boys\" and he lived there for five years.\n\"He didn't have any friends there. He had no social worker that knew him. He had no teachers that knew him.\"\nRob said Ronnie would often ask \"have I done a bad thing?\" something which they believe he picked up from his time at the school.\n\"He was always worried he had offended you, or done something wrong.\"\nAged 15, Ronnie was sent back to Cardiff \"to nothing\" they said.\nThe couple said Ronnie was a bit awkward to begin with as he would struggle to make any eye contact and conversation was kept to a minimum.\n\"But then we got to know him and, in truth, we got to love him,\" they said.\nThey helped Ronnie get a job as a waste collector and took him to buy new clothes after finding out he wore the same clothes he was given as a teenager at the school.\n\"We didn't have kids of our own, it was like dressing your kids for school, we were proud parents,\" said Rob.\n\"As we came out of the shop, she [Dianne] said to me: 'He's got a job as a dustman, we've dressed him up as though he's the front man of the Dorchester Hotel',\" Rob laughed.\nRob, who was a lawyer, would get up an extra hour early to drop Ronnie to work before going to work himself.\nWhen he would get home, Rob said Ronnie would often be sitting there, just smiling, and one night he asked: \"Ronnie, what's amusing you so much?\"\nRonnie replied: \"Rob, when you take me to work in the mornings, the other men say 'who is that who brings you to work in that car?' And I say 'oh that's my solicitor'.\n\"We don't think he was proud of being taken to work by a lawyer, but we think maybe he never had somebody take him on his first day of school,\" said Rob.\n\"And now he's almost 30... at last somebody is at the gate.\"\nRonnie had many rituals they became accustomed to, including emptying the dishwasher each morning, to which Rob would act surprised to avoid Ronnie's disappointment.\n\"It's hard to look surprised when you get the same question on Tuesday that you had on Monday, but that was Ronnie.\n\"We did that for 45 years,\" he laughed.\n\"He obviously struggled to read and write, but he would buy the South Wales Echo every day,\" Dianne added.\nRonnie would buy them the same Marks and Spencer gift cards every Christmas but each year he held the same excitement for their reaction.\nRonnie spent a lot of his spare time at their local church, gathering donations for the homeless and setting up for services, \"meticulously\" lining out the chairs.\nDianne recalled one day he came home with a different pair of shoes on, and she asked: \"Ronnie, where are your shoes.\"\nHe told her a homeless man needed them.\n\"That's the type of person he was. He was amazing,\" they said.\nOne of their lowest times was when Dianne was ill with ME, also known as chronic fatigue syndrome , as she recalled there being days where she couldn't get out of bed.\n\"I had a little three-year-old daughter, Rob was away working,\" said Dianne.\nBut she said Ronnie was \"remarkable\" and came into his own, making milk bottles for their son Lloyd, helping out around the home and playing with their daughter Katie.\nWhile they admitted the dynamic had its difficulties, including battling Ronnie's gambling addiction for 20 years, they couldn't imagine their lives without him.\n\"It's not something I would recommend as a strategy,\" said Rob, \"but Ronnie enriched our lives in many ways\".\n\"He had a great heart Ronnie. He was kind, he was frustrating,\" said Dianne.\n\"Sometimes I was his mother, sometimes I was his social worker and sometimes I was his carer.\n\"Somebody said to them [their children] one day, 'how did you cope with Ronnie when your friends came to the house' and they said 'well, we don't think about it really, it's just Ronnie'.\"\nRob added: \"Our kids had never ever known life without Ronnie. He was there before they came and he was there when they were gone, with children of their own.\"\nOnly once did the couple consider supporting Ronnie to live independently, a few years after he moved in.\nAs their two children were growing older and space felt limited in their one-bathroom home, they approached Ronnie's room to suggest him getting a flat down the road from them.\nBut as they entered, he repeated that familiar question: \"Have I done a bad thing?\"\nRob said Dianne hushed him out of the room, burst into tears and said \"I can't do it.\"\nA few nights later, Ronnie entered their room and asked: \"We three are firm friends, aren't we?\"\n\"I said 'yes Ronnie, we three are firm friends',\" said Rob.\n\"And we will be together forever won't we?\" he asked.\n\"And there was a moment's pause, probably too long, I looked across to Di and I said 'yes Ronnie, we will be together forever'.\n\"And we were.\"\nRonnie died in 2020 at the age of 75 after suffering a stroke and the couple say they miss him terribly.\nOnly 50 people were allowed to go to his funeral due to Covid but \"tickets were hotter than a Coldplay concert\" Rob joked.\nThey received at least 100 sympathy cards, from \"Oxford University professors, to politicians and the unemployed\".\nAfter his death, a new £1.6m wellbeing centre attached to Glenwood Church in Cardiff was named Lockwood House, after Ronnie.\nBut the old building and the new building didn't quite match, and they needed extra funding to finish the renovation.\n\"But they needn't have worried,\" said Rob.\n\"Almost to the penny, it was the exact amount Ronnie had left in his will.\n\"In the end the homeless man put the roof over all of our heads.\"\n\"Isn't that amazing, I just think it's all meant to be,\" said Dianne.\n\"People say to us, how did it happen - 45 years - but the honest truth is, in some ways, it happened a day at a time.\n\"Ronnie brought a richness into our lives.\"\nAdditional reporting by Greg Davies"
    },
    {
      "id": 5,
      "title": "Brazil ex-President Jair Bolsonaro's surgery for hernia 'successful'",
      "link": "https://www.bbc.com/news/articles/c898zxyznxpo",
      "content": "The jailed ex-president of Brazil, Jair Bolsonaro, has undergone a successful surgery for a double hernia, his wife Michelle says.\nThe former leader is serving a 27-year sentence for plotting a coup after he lost the 2022 presidential election to his left-wing rival, Luiz Inácio Lula da Silva.\nBrazil's Supreme Court granted permission for the 70-year-old to be transferred from the room in the federal police headquarters where he is serving his sentence to a hospital in the capital, Brasília, for the procedure.\nAhead of the surgery, Jair Bolsonaro endorsed the candidacy of his eldest son, Flávio, for the 2026 presidential race.\nThe former president made his decision known in handwritten letter that was read out by Flávio Bolsonaro outside the hospital were his father is being treated.\n\"During my life, I have fought tough battles, paying a high price with both my health and my family, to defend what I think is best for our country,\" Bolsonaro wrote.\n\"I hand over what is most important in the life of a father - my own son for the mission of rescuing our country, Brazil.\"\nFlávio Bolsonaro, a 44-year-old senator, had already announced his decision to run for president for his father's Liberal Party.\nEalier this month, he said his father had entrusted him \"with the mission of continuing our national project\". But Jair Bolsonaro's letter, which has been published by Brazilian media, is confirmation the senator has his father's backing.\nThe incumbent, President Lula, has already announced he plans to run again in the presidential election scheduled for October 2026.\nIn 2022, the presidential election went into a run-off, which saw the older Bolsonaro take on ex-President Lula.\nWhen Lula narrowly won, Jair Bolsonaro refused to accept the result and plotted with top military leaders to prevent Lula from taking up office.\nWhile the plot failed to enlist enough support from the military to go ahead, it did culminate in the storming of government buildings by Bolsonaro's supporters on 8 January 2023.\nBolsonaro was found guilty of coup-plotting and sentenced in September this year.\nDespite the guilty verdict, the older Bolsonaro still wields considerable political influence.\nBrazil's Congress passed a bill last week to significantly shorten Bolsonaro's sentence but President Lula said he would veto it.\nJair Bolsonaro is expected to be transferred back to federal police headquarters as soon as doctors give the go-ahead."
    },
    {
      "id": 6,
      "title": "Turkey detains 115 IS suspects 'planning New Year's attacks'",
      "link": "https://www.bbc.com/news/articles/cn98w93l8plo",
      "content": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the so-called Islamic State group.\nMass raids were carried out at 124 addresses across Istanbul, the city's chief prosecutor said, with firearms, ammunition and \"organisational documents\" seized.\nOfficials said IS supporters had been actively planning attacks across Turkey this week, particularly against non-Muslims.\nPolice detained 115 suspects but efforts are ongoing to trace a further 22, an official statement read.\nThe prosecutor's office said the suspects were in contact with IS operatives outside Turkey.\nThe announcement comes two days after Turkish intelligence agents carried out a raid against the group on the Afghanistan-Pakistan border.\nA Turkish national who is alleged to have held a senior role with the IS wing operating in the region was detained and accused of planning attacks against civilians.\nTurkey's security services regularly target people with suspected links to IS.\nThe country shares a 900km (560 mile) border with Syria, where the group continues to operate in parts of the country.\nSyria's president Ahmed al-Sharaa, who has close ties to the Turkish government, has vowed to work with the US and Europe to root out surviving elements of IS.\nThe US launched a wave of air strikes against the group's positions across Syria on Friday in response to the killing of three Americans.\nTwo US soldiers and a civilian interpreter were killed by IS gunmen during an ambush earlier this month ."
    },
    {
      "id": 7,
      "title": "Jingle bills: Arkansas Powerball player strikes $1.8bn jackpot on Christmas Eve",
      "link": "https://www.bbc.com/news/articles/cwyw4x39jdwo",
      "content": "A Powerball player in Arkansas won a whopping $1.817bn (£1.34bn) jackpot in a Christmas Eve drawing, making it the second-largest lottery prize ever claimed.\nThe single winning ticket matched all six numbers  - 4, 25, 31, 52, 59 and red Powerball 19 - giving the winner the option of taking a lump-sum cash payment of  $834.9m.\nThis marks only the second time a Powerball jackpot has been won by a ticket sold in Arkansas, according to the lottery operator. Powerball did not identify the winner.\nThe largest single-ticket prize remains the $2.04bn jackpot won in 2022 by a player in Altadena, California.\nIn order to win the jackpot, a lottery ticket holder must match all five white balls and the red Powerball selected during a drawing.\nTickets for the lottery cost $2 each - and the odds of winning the jackpot are 1 in 292.2 million, according to game organisers.\nA winner has an option to choose a lump-sum payment or receive the full amount in an annuity paid over 29 years, but most winners opt for the upfront cash option.\nThe game, which began in 1992, is played in 45 of the 50 US states, the capital city of Washington, and in the US territories of Puerto Rico and the Virgin Islands.\nThe winnings are subject to federal taxes of between 24% and 37%, and, in most cases, state taxes."
    },
    {
      "id": 8,
      "title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
      "link": "https://www.bbc.com/news/articles/cm21728nwxlo",
      "content": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Peter's square.\nHe called for an end to conflicts around the world during his Urbi et Orbi address, which is traditionally delivered by the pontiff on Christmas Day to worshippers gathered in Vatican City.\nSpeaking about Ukraine, the Pope said: \"May the clamour of weapons cease, and may the parties involved, with the support and commitment of the international community, find the courage to engage in sincere, direct and respectful dialogue.\"\nHis plea comes as US-led negotiations on a deal to end the fighting continues.\nThe US has sought to put together an agreement acceptable to both sides, but direct talks between Russian and Ukraine have not taken place during this latest round of diplomatic efforts.\nPope Leo also decried turmoil and conflict plaguing other parts of the world, including Thailand and Cambodia where deadly border clashes have flared up despite a ceasefire in July.\nHe asked that the South East Asian nations' \"ancient friendship\" be restored and \"to work towards reconciliation and peace\".\nDuring an earlier Christmas Day sermon in St Peter's Basilica, Pope Leo lamented conditions for homeless people the world over, and the damage caused by conflicts.\n\"Fragile is the flesh of defenceless populations, tried by so many wars, ongoing or concluded, leaving behind rubble and open wounds,\" he said.\nHe said the story of the birth of Jesus showed that God had \"pitched his fragile tent\" among the people of the world. \"How, then,\" he asked, turning his attention to the conditions of Palestinians, \"can we not think of the tents in Gaza, exposed for weeks to rain, wind and cold?\"\nGaza has been devastated by Israeli bombardment in a two-year war, triggered by Hamas's attack on Israel on 7 October 2023.\nWinter storms have compounded the plight of the territory's 2.1m population, nearly all of whom have been displaced and their homes damaged or destroyed.\nAid agencies have called for Israel to allow more tents and urgently needed supplies into Gaza.\nCogat, the Israeli military body which controls Gaza's border crossings, has dismissed claims of deliberate aid restrictions, saying almost 310,000 tents and tarpaulins had been delivered since the start of the ceasefire in October."
    }
  ]
}