{
  "category": "sport",
  "articles": [
    {
      "id": 1,
      "title": "A 'throwback' to Man Utd's past, defensive chaos and a classic",
      "link": "https://www.bbc.com/sport/football/articles/cx2edrx69rjo",
      "content": "A remarkable, chaotic, mesmerising Premier League thriller at Old Trafford captured the imagination even of the clinical operators in the dugout.\n\"Really difficult to explain,\" said Bournemouth manager Andoni Iraola. \"But I prefer 4-4 to 0-0.\"\n\"Fun,\" was Manchester United counterpart Ruben Amorim's initial observation.\nAnalysing for Sky Sports, Jamie Carragher went further.\n\"The best game of the Premier League season so far,\" said the former England and Liverpool defender. \"It was almost a throwback to Alex Ferguson's Manchester United with attacking football.\n\"It is the best I have seen Man Utd. For the majority of the game, they were absolutely fantastic.\n\"For the first time under Amorim - and first time in a long time - I felt like I was watching what Man Utd are supposed to be. Wave after wave attack, but the inability to defend has hurt them.\"\nFor the record, Ferguson took charge of two games when United scored four and didn't win.\nThe first was a significant factor in his side's failure to win the 2012 title as United threw away a 4-2 lead and drew 4-4 with Everton at Old Trafford.\nThe other was Ferguson's very last match, an extraordinary 5-5 draw at West Brom in 2013.\nAmorim has a very long road ahead before he can be compared to Ferguson.\nBut at least, on a night when his side led twice in the first half, then fought back to get their noses in front again after conceding two in a matter of minutes at the start of the second, and finally had to settle for a point as Bournemouth finished the stronger, he understood what everyone had witnessed.\nIn a vibrant first half, the hosts' had the highest non-penalty xG value (2.49), most shots (17) and joint-most touches in the opposition's box (30) of any side in the opening 45 minutes of a Premier League match this season.\n\"If you understand a little bit,\" Amorim said. \"If you follow the club like I follow the Premier League for so long, you [know you] have not just the duty to try to win the games. The way you try to win the games is so important for the fans.\n\"Of course they are desperate to win, but also, I feel that they are desperate to be inspired when they come to Old Trafford.\n\"Today was inspiring, I think, also because of Bournemouth. But in the end that's the feeling of frustration of not winning the game.\"\nFormer United captain Gary Neville agreed – kind of.\n\"It might not be the greatest Man Utd team, and they might have problems at the back, but you can recognise it,\" he said.\n\"It was a crazy game. The defences have been obliterated. It was absolute madness.\"\nNeville was part of United sides who gambled to try to win rather than protect what they had. Ferguson regarded it as a key element of his managerial philosophy.\nThe modern-day team are not at that level.\nAnd now, they have a problem.\nThis result means they have taken two points from three home league games most observers expected them to win.\nThey have kept just one clean sheet in their 15 Premier League games this season, with only bottom side Wolves keeping fewer.\nThey have also just had six shutouts in 42 games under Ruben Amorim.\nNow they go to in-form Aston Villa not only without opening goalscorer Amad Diallo and dangerman Bryan Mbeumo, who join already absent Noussair Mazraoui on Africa Cup of Nations duty, but also missing veteran midfielder Casemiro, who serves a one-match ban after picking up his fifth yellow card of the season.\nThere was no hint at good news either over absent defensive pair Harry Maguire and Matthijs de Ligt.\n\"We'll be ready for the challenge,\" Amorim assured United's legion of fans.\n\"We already knew a lot of teams are going to lose players, a lot of teams have injuries.\n\"We just need to go for the next game with the responsibility to fight and win the game.\"\nEven during the game there was debate around how much Amorim tweaked his 3-4-2-1 system.\nFormer Republic of Ireland international defender Jim Beglin, covering the game for the Premier League's worldwide television feed, felt it was significant. Others felt it was slight, until Lisandro Martinez came on for Leny Yoro in the second-half and United definitely reverted to a flat back four.\nThe key was Amad, who was pushed further forward and instead of dropping into a wide defensive role in the first half hour, instead was inside Leny Yoro, who took the right-back slot.\nIraola, whose own side reverted to five at the back after USA international Tyler Adams suffered a first-minute injury, felt it was \"the same system they always play but they adapt. It is a very flexible system\".\nAmorim, who once said he wouldn't change the system even if the Pope asked him to, wasn't even getting into a debate.\n\"That is for you to discuss, not me,\" he said. \"I know that you guys know I trained this week with a back four but it is for you to discuss this week.\n\"I will say the same thing, you can play with the same players and what looks like one thing is another.\""
    },
    {
      "id": 2,
      "title": "Menzies apologises for punching table after loss",
      "link": "https://www.bbc.com/sport/darts/articles/c62vd6n9y5po",
      "content": "Cameron Menzies has apologised for angrily punching a drinks table after his five-set defeat by Charlie Manby in the first round of the PDC World Championship.\nThe 26th seed from Scotland hit the underside of the table three times before holding his hand up in apology to the Alexandra Palace crowd as he left the stage.\nMenzies, 36, was pictured with blood pouring from a gash on his right hand.\nHe had led 1-0 and 2-1 in sets before highly rated English debutant Manby, 20, fought back and clinched victory with his seventh match dart.\nIn a statement released after the match, Menzies said: \"First of all, I would like to apologise for what happened. I am sorry that I reacted in the manner that I did.\n\"It's not an excuse, but I have had a lot of things on my mind recently and I suppose it all just became too much at the end.\n\"It has not been an easy time for me with my uncle Gary passing away recently. I saw him four days before he died and he gave me a look which told me how much he thought of me.\n\"Had I won the game against Charlie, my second match would have been on the day of Gary's funeral and that hasn't been lost on me.\n\"Let me say again, that's no excuse for what I did on the stage. It was the wrong thing to do and I don't want it to take anything away from Charlie. He played well.\n\"This is not how I would like people to view me. Yes, I can get emotional at times, but not like that and that wasn't right.\"\nProfessional Darts Corporation chief executive Matt Porter said: \"I spoke with Cameron and his management before he left the venue, and he knows there is support available from the PDC and the PDPA [Professional Darts Players Association].\n\"Any incident of this nature is reported to the Darts Regulation Authority for review, but our main priority is the player's health and wellbeing.\"\nIt is the second year running that Menzies has been knocked out in the first round, after he broke down in tears during and following his exit to Leonard Gates last December.\nMenzies later revealed his father Ricky had been ill in hospital at the time.\nPlayers can be sanctioned under Darts Regulation Authority rules for aggressive, disruptive or abusive behaviour.\nFormer World Championship semi-finalist Wayne Mardle said on Sky Sports: \"The frustration boiled over, the anger and the anguish of losing, but you've got to control that. That's what conducting yourself in the right way is all about.\n\"He let himself down and I'm sure he'll be punished accordingly by the Darts Regulation Authority, but hopefully the Professional Darts Players Association are there for him.\n\"You've got to control yourself and he didn't and you can't do that anywhere, let alone on the biggest stage of them all. I hope he can correct his behaviour and move forward.\"\nTwo-time champion Peter Wright made it through to round two with a straight-set win over Noa-Lynn van Leuven.\nThe 55-year-old Scot, wearing a festive-themed outfit, landed a 152 checkout in the first set and was taken to a deciding leg in the second, before closing out victory comfortably in the third.\nWright, who will face German Arno Merk in round two, told Sky Sports: \"I know I didn't play well but I will play well in the next round. You've got to grow into the tournament.\"\nWright, the winner in 2020 and 2022, has struggled for form in recent times and has slipped to 30th in the PDC world rankings as a result.\nHe reached the quarter-finals last year, ending Luke Humphries' title defence on his way to the last eight before losing to Stephen Bunting.\nVan Leuven, who became the first transgender player to appear at the PDC World Championship last year, was one of five players from the Women's Series to qualify for the event at Alexandra Palace.\nWelsh fifth seed Jonny Clayton averaged just above 93 in a 3-1 win against English debutant Adam Lipscombe, while Dutch 29th seed Dirk van Duijvenbode came through the deciding set of an entertaining match with Belgium's Andy Baetens.\nNorthern Ireland's Brendan Dolan, Austria's Mensur Suljovic and Max Hopp of Germany were also victorious on Monday while Englishman Connor Scutt edged out Australian veteran Simon Whitlock 3-2.\nAmong the players in first-round action on Tuesday are England's Chris Dobey, a semi-finalist last year, and Wales' 2021 world champion Gerwyn Price.\nBrendan Dolan 3-1 Tavis Dudeney\nCameron Menzies 2-3 Charlie Manby\nMensur Suljovic 3-1 David Cameron\nPeter Wright 3-0 Noa-Lynn van Leuven\nMartin Lukeman 1-3 Max Hopp\nDirk van Duijvenbode 3-2 Andy Baetens\nJonny Clayton 3-1 Adam Lipscombe\nConnor Scutt 3-2 Simon Whitlock\nFrom 12:30 GMT:\nAlan Soutar v Teemu Harju\nNick Kenny v Justin Hood\nScott Williams v Paolo Nebrida\nChris Dobey v Xiaochen Zong\nFrom 19:00 GMT:\nRicardo Pietreczko v Jose de Sousa\nDanny Noppert v Jurjen van der Velde\nGerwyn Price v Adam Gawlas\nNiko Springer v Joe Comito"
    },
    {
      "id": 3,
      "title": "Rohl's Rangers roll on - should Celtic & Hearts be worried?",
      "link": "https://www.bbc.com/sport/football/articles/cg7vedj1zz4o",
      "content": "In the aftermath of Rangers' narrow win over Hibernian, former striker and coach Billy Dodds said: \"This is turning into a fascinating title race with how many teams are involved in it.\"\nWhen Danny Rohl was appointed as Rangers head coach on 20 October, a title race was one of the furthest things from their fans' mind.\nThey were still recovering from watching their former boss Russell Martin get bundled into the back of a getaway car at Falkirk following a 1-1 draw which left them eighth in the Scottish Premiership, 11 points off leaders Hearts and just four points above bottom side Aberdeen.\nIn between that embarrassment and the German's unveiling, Steven Smith oversaw a 2-2 meet with Dundee United that left Rangers 13 points adrift of the summit.\nTheir latest win on Monday, the sixth since Rohl came in, moved the Ibrox side up to third and nine points off Hearts - who they visit on Sunday - with a game in hand.\n\"Rangers deserved the win, they're putting a run together now,\" Dodds said on BBC Sportsound.\n\"It's a vital three points, they were pragmatic how they went about it.\n\"If you play poorly, just make sure you're getting the win. That's what Rangers are doing.\"\nIt was far from a magic Monday under the Ibrox lights. Much more, get the job done and up the road.\nBut Rangers will, rightly, take that all day long for now.\nFor much of the first half, they were second best to a Hibs side who came flying out the traps before taking fright at the sight of the final third.\nDavid Gray's side built from the back in abundance, exploited the swathes of space their hosts allowed them in midfield, but yanked the handbrake in the face of a Rangers defence who were there to be tested.\nIt was \"the theme of the night\" which frustrated Gray, who was looking to guide Hibs to back-to-back league wins in Govan for the first time since 2018, but something which the Ibrox side capitalised upon.\nWhen Emmanuel Fernandez flicked on from Dujon Sterling's sublime cross, it was an action completely against the run of play.\nIt didn't quite light a spark among the Rangers ranks, but it provided them with something to protect, which they ended up doing so with relatively little fuss.\n\"It was not always the nicest football but we are finding a way to win games,\" Rohl told BBC Scotland after his side secured a fifth clean sheet.\n\"I'd like us to be more clinical. I'm happy with the points but, of course, we have to improve. It's step by step and for me it's about winning games.\n\"The win was deserved, we played not every part of the game where you think 'it's amazing' but with clean sheets and being clinical in the moment, you deserve to win.\"\nIt is a win that sets up a humdinger of a match with Hearts at Tynecastle on Sunday.\nDerek McInnes' league leaders had lost their way a little, but a statement victory over Celtic, backed up by a gritty win against Falkirk in horrendous conditions at the weekend re-emphasised their title credentials.\nWhen the sides last met in September, Hearts' victory at Ibrox - their first since 2014 - moved them three points clear at the top of the table as Martin became the first Ibrox manager to fail to win any of his first five league games in 47 years.\nThe mood music has changed a bit around Rangers since then thanks to the stability and pragmatism Rohl has brought to the club, at least in the league, where he remains unbeaten.\nSeldom does he speak to the media without mentioning the need to take \"a step forward\" no matter how big or small.\nShould they leave Gorgie with points in tow, though, it will be something of a leap.\n\"We have to be brave,\" Rohl added. \"When we play forward instead of backwards, then I think we have more than enough quality to hurt all opponents in the league.\n\"Let's see [how Sunday's game goes].\n\"We make it a good game, put all the effort in and everyone knows what's in the game.\n\"It's about three points, the next step and let's continue like this.\"\nAlex: First and foremost is to win. Performances come next. Achieving wins generates confidence as well. Rather get win playing poorly than losing and playing well.\nAlastair: Don't quite know what to say to that, horrible to watch but keep on winning. Given I cheered anti-football all the way to the UEFA Cup final, I guess I need to find a way to accept our new normal and get behind what's happening at the big house.\nGavin: Scrappy game, but Danny Rohl's Rangers keep rolling on. He keeps on winning, and that's all that matters. No whiteboard needed, just a level head.\nDerek: Three points but another slow, lethargic performance. Where is all this fast flowing attacking football? On a positive note, good to see Dujon Sterling back, a great clearance off the line, then a quality cross for goal. Onwards and upwards.\nWilliam: Not a pretty watch but three points are all that matters just now. Just have to keep the momentum going at a very tough match coming up at Tynecastle on Sunday."
    },
    {
      "id": 4,
      "title": "Barking out orders: Stokes wants England to 'show a bit of dog'",
      "link": "https://www.bbc.com/sport/cricket/articles/ceq1vl3y2pro",
      "content": "Ben Stokes has asked his England team to \"show a bit of dog\" in the crucial third Ashes Test against Australia in Adelaide.\nEngland are 2-0 down and must end a 17-match winless run in this country at the Adelaide Oval in order to keep their hopes of regaining the urn alive.\nFollowing the defeat in the second Test at the Gabba, Stokes said his dressing room was \"no place for weak men\".\nAnd the captain admitted his team have had \"raw\" conversations in the eight days since the loss in Brisbane.\nWednesday's Test at the Adelaide Oval (23:30 GMT Tuesday) is a return for Stokes to the ground where he made his Test debut 12 years ago.\nOn that occasion, as a  22-year-old he introduced himself to Ashes cricket by clashing with Australia wicketkeeper Brad Haddin.\nAsked if on-field fight is an instinct that comes more naturally to him than his team-mates, Stokes responded: \"It's a word that I think people don't really understand what it means. What it means to me could be completely different to someone else.\n\"It's just trying to fight in every situation that you find yourself in and understanding the situation and what you feel is required for your team. Just look at your opposition every single time and show a bit of dog. That's fight to me.\n\"As long as you go out there and everyone is in that mindset around the situation and what is needed, you're giving yourself the best possible chance if you've got a bit of dog in you.\"\nStokes said his team have had \"meaningful conversations\" and used the third Test against India at Lord's in July as a source of inspiration.\nOn that occasion, England won a fractious contest by 22 runs in a thrilling conclusion at the home of cricket.\n\"That's exactly what I'm on about,\" said the all-rounder. \"That was a moment where we all did that, we all noticed and we all identified that moment.\n\"You saw the way the team came out on that day. We were probably in a situation where we would have to be absolutely perfect to win that game and we were. On the back of attitude, mentality towards that specific situation is what gave us the best chance of winning that game.\"\nStokes also explained the decision to omit Shoaib Bashir from the England XI in Adelaide.\nThe tourists have made one change to their team from Brisbane, with Josh Tongue replacing fellow pace bowler Gus Atkinson. All-rounder Will Jacks keeps his place ahead of Bashir.\nWhen Jacks was chosen instead of Bashir in Brisbane, Stokes said Bashir would remain England's first choice when a specialist spinner was required.\nHowever, at a venue that usually offers something to spinners, and with temperatures forecast to reach 39 degrees this week, Bashir has been left out. The 22-year-old has returned figures of 2-266 in two tour matches in Australia.\n\"I wouldn't say it's got anything to do against Bash whatsoever,\" said Stokes. \"The main thing is we're 2-0 down. We need to win the next three.\n\"We feel having Jacksy down at number eight obviously strengthens our batting a little bit deeper if we need to go there. And he's more than capable enough to handle that role with the ball when we need to call upon it.\"\nEngland are at the point of no return in yet another Ashes series in Australia – the visitors have lost the previous three series in this country 5-0, 4-0 and 4-0 respectively.\nHeavy defeats in Australia often signal change around the management of the England team.\nOn Sunday head coach Brendon McCullum said speculation his job could be on the line if England lose this week \"does not really bother me\".\nAnd Stokes said he will not be leading his team with an agenda to safeguard his position.\n\"If people are trying to protect themselves over the greater good, which is the team, and look after their own back - I'm certainly never going to do that,\" said the Durham man.\n\"My job is to captain this team and I'll do everything I can to lead the team in the best possible way that I can.\n\"As soon as I start thinking I'm going to look after myself here, that's certainly nothing that I ever will do and certainly nothing that Brendon will do. We both give everything that we possibly can towards the team and it will always be like that as long as we are both in these roles.\""
    },
    {
      "id": 5,
      "title": "How much do you know about Sports Personality nominee McIlroy?",
      "link": "https://www.bbc.com/sport/golf/articles/c157wl7vdq4o",
      "content": "Rory McIlroy is one of six athletes shortlisted for the 2025 BBC Sports Personality of the Year award.\nBut how much do you know about the golfer?\nTest your knowledge with our quiz.\nTest your knowledge on the other contenders for Sports Personality of the Year\nHannah Hampton\nChloe Kelly\nEllie Kildunne\nLuke Littler\nLando Norris"
    },
    {
      "id": 6,
      "title": "Pep proteges reunite as Chelsea face Cardiff",
      "link": "https://www.bbc.com/sport/football/articles/ceq1178gzwlo",
      "content": "Few coaches have influenced football as significantly as Pep Guardiola.\nFrom Mikel Arteta leading Arsenal to the top of the Premier League, to Vincent Kompany's Bayern Munich dominating the Bundesliga, the Catalan counts some of the game's finest managers among his proteges.\nAnother two of his disciples, Chelsea boss Enzo Maresca and Cardiff City head coach Brian Barry-Murphy, will be reunited when their teams meet in an EFL Cup quarter-final on Tuesday.\nBarry-Murphy succeeded Maresca as manager of the Manchester City Elite Development Squad in 2021, with the Italian rejoining the club as Guardiola's first-team assistant coach a year later.\nThe two had a season together in Manchester before Maresca was appointed Leicester City boss, guiding the Foxes to Premier League promotion in his first season.\nCoincidentally, Barry-Murphy then also followed Maresca to Leicester, albeit six months after the former Sevilla midfielder had left to take the top job at Chelsea.\nTwo years into Maresca's tenure at Stamford Bridge – and at a turbulent time for the Italian – he takes his Club World Cup champions to League One leaders Cardiff.\n\"He [Barry-Murphy] is doing a great job. They are top of the league, they are playing nice football and winning games,\" says Maresca.\n\"It's a dangerous game, a tricky game, so we need to have attention. We need to be careful because, again, we can achieve something important. That is the third semi-final in 18 months [for Chelsea under Maresca].\"\nMaresca has endured a fraught few days at Chelsea. The 45-year-old described the 48 hours before Saturday's 2-0 win over Everton as the \"worst\" of his reign, a cryptic but apparently pointed remark aimed at his club's owners.\nWhile Maresca was irked to be asked to clarify those comments on Monday, the mood was decidedly more relaxed at Cardiff City Stadium, where Barry-Murphy fielded questions about his friendship and working relationship with his Chelsea counterpart.\n\"He's always been there for me and his staff, my admiration for him and his staff is obvious,\" said Barry-Murphy.\n\"He's a brilliant guy, my wife is a huge fan. Sometimes I think she prefers him to me. She's a big fan of his wife and children, I should add.\n\"But when the game comes around, you have to be able to also compete against a club like Chelsea and understand that ourselves, we're a very, very big club with a huge support base and trying to give those fans something to feel exhilarated by tomorrow.\n\"I think he's the coach of the highest calibre, and he's proven that in the short time he's been there. He's obviously taken lessons in the Premier League and now done an incredible job with Chelsea.\"\nAlthough they are operating at different levels, there are similarities in the ways that Maresca and Barry-Murphy see the game.\nLike Guardiola, both men want their teams to dominate and attack, often by controlling possession and playing expansively.\nThe obvious difference on Tuesday will be that Maresca will have at his disposal a squad of enviable depth which won the Uefa Conference League and Club World Cup earlier this year, while Cardiff are playing in the third tier of English football for the first time in 22 years, albeit successfully.\n\"I think he has a very clear idea how he wants to see the game played. I think we all have different parts that make us all individual,\" says Barry-Murphy.\n\"One of the biggest things I took from Man City was you always have to have your own way of doing things, your own beliefs. I'm my own man and I want to do things my own way.\"\nIt is not only Maresca who Barry-Murphy will know in the opposition dugout at Cardiff City Stadium, the Irishman having coached several Chelsea players at their previous clubs.\n\"It's a little bit unusual because of the crossover between the amount of players who've been at Manchester City and even back in the day at Rochdale, where I was manager of Robert Sanchez, or he managed me. No, I love him,\" Barry-Murphy jokes.\n\"I was at Leicester last season and Facundo Buonanotte was there, brilliant player on loan from Brighton. Then there's Romeo Lavia, Cole Palmer and Liam Delap - who's suspended - at Manchester City. All those guys, unusual connection.\"\nMaresca has promised to make changes for this game, given Chelsea's Premier League and Champions League commitments.\nNo matter how much he rotates his squad, though, Chelsea will still be overwhelming favourites, even if that tag does not sit easily.\n\"These are the worst games,\" says Maresca. \"Football is full of these kinds of games where the favourite one, they can lose.\n\"That's why the focus has to be on Cardiff.\"\nFor Cardiff, there is nothing to lose.\nFour points clear at the top of League One, playing attractive football with a team packed full of local young talent and welcoming former Champions League winners to their home on Tuesday, the Bluebirds have rediscovered their joy this season.\n\"The biggest thing always I learned from the players is there's different spells in my career where an occasion like tomorrow night was quite a daunting task,\" says Barry-Murphy.\n\"You think about the difficulties you may face, but the young players here have got no fear.\n\"They really attack every single situation that they come up against and try and overcome every obstacle.\n\"No matter what happens tomorrow, I'm sure the players will give every single thing they have for the club and come out the following day better players for it.\""
    },
    {
      "id": 7,
      "title": "Who has made Troy's Premier League team of the week?",
      "link": "https://www.bbc.com/sport/football/articles/c1lr7jp8gvdo",
      "content": "After every round of Premier League matches this season, BBC football pundit Troy Deeney will give you his team and manager of the week.\nHere are this week's choices. Do you agree? Give us your thoughts using the comments form at the bottom of this page.\nBernd Leno (Fulham): Excellent for Fulham in their 3-2 win at Burnley . I know the result looks like a close game and Fulham will say they deserved to win, but Bernd Leno made five or six good saves at the start of the game that kept them in it. Burnley will feel hard done by.\nMalo Gusto (Chelsea): I'm not the biggest lover of this fella if I'm being honest. I can't work out why I don't rate him but I just don't. But credit where credit is due - he scored a good goal and played well against Everton - who were poor. He seems to be stepping up. A goal and an assist. I have to be as fair as I can.\nNordi Mukiele (Sunderland): He was excellent in the win over Newcastle . He got a yellow card but shut down Anthony Gordon, one of the best wingers in the Premier League who will probably start for England at the World Cup, and Mukiele didn't allow him to get anything going. He handled the mental appoach to it fantastically. He got the crowd involved and was part of a monumental victory for Sunderland.\nCalvin Bassey (Fulham): He chipped in with a goal at Burnley and might be my favourite personality in football - happy-go-lucky, plays with his heart on his sleeve. He's going to make mistakes but doesn't try to be perfect or polished and it was another dominant display by him. It looks like he's at fault for the first goal but it's actually Antonee Robinson running out to the left for no good reason.\nIbrahima Konate (Liverpool): Konate was under a lot of pressure and people were questioning whether he's going to be at Liverpool long-term - whether he's letting the transfer saga get to his head. He stepped up again in the win against Brighton and delivered.\nBruno Fernandes (Manchester United): I'm seeing a lot of talk about the 4-4 draw with Bournemouth being the best game we've seen all year. Amateur-hour defending. But quality with the corner for Casemiro's goal and then that free-kick - you get in team of the week if you spank one of them in the top bin. He deserves that.\nIbrahim Sangare (Nottingham Forest): I was struggling to put Forest players in, which is weird when they won 3-0 , but I thought Spurs were that bad. So bad you couldn't turn around and say 'these were great players'. But Sangare with a goal and two assists has had a great day for a holding midfielder. He's thriving under Sean Dyche. They lose him now for the Africa Cup of Nations with Ivory Coast, which is really disappointing.\nCallum Hudson-Odoi (Nottingham Forest): He's got all the ability and potential to be whatever he wants. We need to see more games like this - goals and assists. I thought he was excellent on the day and Spurs couldn't live with him - he ran them ragged.\nHugo Ekitike (Liverpool): The most underrated striker in the Premier League. Two goals in back-to-back games. The kid scores. He comes off after 70 minutes for Alexander Isak. Fantastic signing. He will be pushing Erling Haaland all the way for most goals. This kid is mustard - he's the real deal. Another one who will be looking at the World Cup and thinking he's got to go - he can play off the left-hand side with Kylian Mbappe for France.\nMorgan Rogers (Aston Villa): Villa are going about their business now. They showed West Ham too many opportunities - they won 3-2 away but on another day they lose. Rogers, fantastic first goal. The calmness and poise to turn and swivel on it. The second, knuckleball. You can try that 10 times and it won't go there, right in the top corner. Making a real argument that he should be starting for England in the opening game of the World Cup. He's growing as a player and a leader. It's no coincidence Villa do well when this kid does well.\nHarry Wilson (Fulham): Just a player you really enjoy watching. He has no real super strength but got two assists and a goal at Burnley. So calm, so poised. Not the quickest but he'll go past you, and knows he'll go on the left foot but you can't stop him. Wonderful football player.\nArne Slot (Liverpool): A massive result against Brighton. It was all about how he handled the Mohamed Salah situation . A lot of pressure on him and Liverpool. He defused the situation perfectly. They got the clean sheet, got the win. Also he managed that Joe Gomez situation - another injury at right-back. Pivotal win for them, and when you look at the table they're seventh. Considering their bad start to the season they're a few points off the Champions League places. They'll feel happy.\nDo you agree with Troy's selections? Who would be in your Team of the Week? Have your say using the comments form below:"
    },
    {
      "id": 8,
      "title": "How Messi's GOAT tour of India hit trouble",
      "link": "https://www.bbc.com/sport/football/articles/clyd12j04ylo",
      "content": "Lionel Messi made headlines for all the wrong reasons on Saturday when his three-day tour of India descended into violence .\nThe Argentina legend was visiting the city of Kolkata at the start of a whistle-stop visit taking in four cities.\nMany of Messi's fans were left feeling short-changed when they failed to get a glimpse of one of the world's most famous players.\nIt was the first time Messi had been to India since 2011.\nThis is how his visit played out.\nFresh from helping Inter Miami win the MLS Cup for the first time , Messi was embarking on a promotional tour.\nIt was called the GOAT India Tour 2025 - GOAT meaning 'greatest of all time'.\nMessi was joined by Uruguay star Luis Suarez and Argentina's Rodrigo de Paul, who also play for Inter Miami.\nThe tour started in Kolkata on Saturday. The trio moved on to Hyderabad later that day, then to Mumbai on Sunday before finishing in New Delhi on Monday.\nIndia was the only country the tour visited.\nThere was a variety of ticket options to suit budgets.\nFor access to the stadium only, face value tickets cost 3,500 rupees (£29) for Kolkata and Hyderabad. For New Dehli, the price was 4,200 rupees (£35).\nHowever, this is about half the average weekly wage in India. But with tickets sold out, fans were paying much more for the chance to see Messi.\nReports in Indian media said some locals had paid up to 12,000 rupees (£99) to get in.\nAmong the other ticket types was a VVIP option which included a meet-and-greet with Messi, including a photograph. Only 100 were available at a price of one million rupees (£8,200).\nMessi landed in Kolkata at 01:30 local time. Thousands lined the roads and congregated outside his hotel to catch a glimpse of him.\nThe day began with the meet-and-greet ticket holders first up from 09:00 to 10:30.\nThen the day took a strange twist.\nA 70ft statue of Messi lifting the World Cup was unveiled by the former Barcelona icon.\nBut he was not present - it was a virtual unveiling. He was on a video screen and pressed a button on a remote control. At this point a blue sheet dropped to reveal the huge iron structure.\nMessi met with Bollywood actor Shah Rukh Khan before heading to Salt Lake Stadium for 11:30.\nThe plan was for him to be at the ground for an hour. He was gone after only 20 minutes and violence erupted because ticket holders did not get to see Messi among the throng of security, politicians and celebrities.\n\"Only leaders and actors were surrounding Messi. Why did they call us then? We have got a ticket for 12,000 rupees, but we were not even able to see his face,\" a fan at the stadium told Indian news agency ANI.\nOne angry supporter told the Press Trust of India news agency that people had paid the equivalent of a month's salary to see the eight-time Ballon d'Or winner.\n\"I paid 5,000 rupees for the ticket and came with my son to watch Messi, not politicians,\" they said.\n\"The police and military personnel were taking selfies, and the management is to blame.\"\nThere was supposed to be a friendly match, more of kickabout, with some local players but this did not happen.\nMessi was whisked off to Hyderabad.\nMessi walked out at the stadium waving to fans, but after his appearance was abruptly ended some frustrated supporters stormed the pitch and vandalised banners and tents, while others hurled plastic chairs and water bottles.\nWest Bengal chief minister Mamata Banerjee said she was \"deeply disturbed and shocked\" by the events.\nAnnouncing an enquiry, Banerjee apologised to Messi and \"sports lovers\" for the scenes at the stadium.\n\"The [enquiry] committee will conduct a detailed enquiry into the incident, fix responsibility, and recommend measures to prevent such occurrences in the future,\" she added on X.\nA spokesperson for Messi said he fulfilled the time commitment that had been agreed in advance. In terms of the organisation of the event itself, he referred the BBC to the apology issued by Banerjee on social media.\nKolkata's Telegraph newspaper said in an editorial piece , external that \"poor management of a hyped-up event, lack of co-ordination\" and security lapses turned the stadium into a \"battlefield\".\nSatadru Dutta, the event organiser, was arrested and a city court remanded him in police custody , external for 14 days.\nThe rest of the tour appears to have gone without a hitch , with fans getting to see Messi, Suarez and De Paul.\nThe Times of India reported , external how the event in Hyderabad went smoothly, with the stands full and Messi staying on the pitch for a full hour.\nAfter leaving Hyderabad, on Sunday Messi met with India cricket legend Sachin Tendulkar in Mumbai.\nFog delayed their arrival into Dehli on Monday, where thousands of fans gathered inside New Delhi's Arun Jaitley Stadium and were treated to a half-hour appearance when the trio kicked balls into the stands, passed balls with a group of children and signed autographs."
    },
    {
      "id": 9,
      "title": "Man Utd midfielder's half-brother wears 'Free Kobbie Mainoo' T-shirt",
      "link": "https://www.bbc.com/sport/football/articles/c9d9nxzg8e4o",
      "content": "A T-shirt worn by Kobbie Mainoo's half-brother was among the post-match talking points at Old Trafford - even after a game as thrilling as the 4-4 draw between Manchester United and Bournemouth.\nJordan Mainoo-Hames wore a 'free Kobbie Mainoo' T-shirt during the match, a move that risks making a delicate situation even more fraught.\nMainoo's United future is the subject of huge debate, with head coach Ruben Amorim yet to hand him a single Premier League start this season.\nAmorim has defended himself on numerous occasions against allegations he does not rate Mainoo and that he has no trust in United's academy.\nThe 20-year-old was keen to join Napoli in the summer but United refused to sanction the move.\nMainoo was introduced to rapturous applause with just under 30 minutes left of Monday's game against Bournemouth. It was his third-longest runout in a Premier League match this season, taking his minutes for the campaign to 302.\nIt is understood that Napoli are still keen to sign the England international - as are a large number of other clubs.\nBut United know if they were to let Mainoo leave for the remainder of the campaign to improve his chances of making England's World Cup squad, they would have to spend significantly more to bring in a replacement because he is on relatively low wages.\nAmorim was not asked about the T-shirt post-match, but spoke about Mainoo last Friday.\nHe refused to say if he would sanction a January move but he would welcome Mainoo seeking him out for a chat.\n\"I had some conversations with him, especially last year, and with other players, but about that subject, no, I didn't speak with him,\" said Amorim.\n\"I will be really pleased if Kobbie comes to talk to me about that. I just want my players happy.\n\"I understand every individual has their goals and the frustration doesn't help anybody.\n\"I'm not going to say what I would say but I would talk to him.\n\"I am completely open, that is clear. I have my ideas and that is also clear. I will not change if I don't believe it but I'm open to speak with any player. I love that.\"\nAmorim has not just upset Mainoo recently.\nBefore the Bournemouth game, he claimed 18-year-old defender Harry Amass was \"struggling in the Championship\" with Sheffield Wednesday, even though he is the club's player of the month. In addition, he said 18-year-old forward Chido Obi was \"not always a starter in the Under-21s\".\nThe comments are understood to have gone down badly with both player representatives and senior academy staff.\nBoth 18-year-olds posted on social media highlighting their achievements before later deleting their posts.\nAmass posted a photo holding  Sheffield Wednesday's player of the month award for November with a smiling emoji, while Obi also posted an Instagram story showing him celebrating a goal for the Under-21s against Manchester City in August."
    },
    {
      "id": 10,
      "title": "What fans, insiders and stats say about embattled Frank",
      "link": "https://www.bbc.com/sport/football/articles/czdg8nv8nlro",
      "content": "In the away end of the City Ground on Sunday, every Tottenham Hotspur supporter was given a free scarf by the club.\nFor at least one Spurs supporter , external , the knitwear was most useful for shielding their eyes from another dismal display by their team.\nSpurs were beaten 3-0 by Nottingham Forest , a result which leaves them 11th in the Premier League, six points off the top four.\nUnder manager Thomas Frank, Spurs have lost as many league games as they have won this season and been beaten in three of their previous five.\nFor some Spurs fans, the comedown six months on from their Europa League triumph is impossible to take and they have turned on Frank.\nThe former Brentford manager's direct style of play, at times poorly implemented by the players, has also not endeared him to some supporters.\nSo where does this all leave Frank? Here's what the fans, the club insiders, and the stats have to say...\nJust when you think it is safe to watch Spurs again, they deliver another nightmarish performance.\nWith consecutive positive performances at home in the Premier League and Champions League last week, it looked as though Thomas Frank's team was starting to build some consistency.\nHowever, after a painfully pessimistic performance against Nottingham Forest on Sunday , Spurs confirmed that they remain well and truly wedged in the 'storming' phase of team development.\nWhen viewed through this lens, you can understand why Frank appears relatively calm on the touchline and in his post-match interviews. The project manager in him knows that change takes time, and what appears to be chaos from the outside is actually an integral part of the transformation needed at this club.\nUnfortunately for Frank, and anyone else who agrees with him that \"this is not a quick fix\", in recent years managers at Spurs have not been given long to turn things around.\nHopefully, this time will be different.\nIn many respects, Frank's appointment at Spurs reminds me of when Gareth Southgate took the England job. Many questioned his experience and doubted his suitability at that level too.\nWhile ultimately Southgate did not win anything with England, he did the unenviable but necessary work of changing the culture and laying the foundations for future success. He turned them into a team that justified the hype.\nI still think Frank is capable of achieving the cultural change needed at Spurs, but as fans we have to start by being honest that we are not the team we want to be. Not yet.\nFor the fans who want Frank gone: who is your preferred candidate to replace him, what does realistic success look like, and how long are you willing to give someone new to achieve it?\nThere is unlikely to be a knee-jerk reaction at Tottenham to Sunday's disappointing loss at Nottingham Forest .\nThomas Frank's future has been thrust back into the spotlight once again following the 3-0 loss at the City Ground that, not for the first time this season, sparked anger from Spurs supporters towards their head coach.\nBut for the time being, there is no sense that the Dane's future is under any immediate threat despite the lacklustre level of performance against Forest.\nFor context, Tottenham were on the back of a three-match unbeaten run ahead of Sunday's loss – a credible 2-2 draw at Newcastle was followed by two straight victories over Brentford and Slavia Prague.\nPrior to the loss to Sean Dyche's side there had been shoots of improvement, so with that said Sunday's loss is unlikely to prompt an immediate change of tact.\nThat's not to say that the backing for Frank is entirely universal behind the scenes at the north London club.\nFollowing the home loss to Fulham on November 29, which extended a worrying run of just one victory in eight matches, well-placed sources told BBC Sport at the time that Frank's performance had come increasing internal scrutiny.\nThe apparent disdain from sections of supporters towards Frank during the opening half of the season is also an unsavoury dynamic that has not gone unnoticed.\nSpurs, though, are yet to reach a point so far this season whereby they have given serious consideration to dispensing with Frank.\nThere is an acknowledgement that there will be bumps in the road, though you can imagine Frank can ill-afford many days like Sunday if those aforementioned doubts aren't to resurface more prominently in the coming weeks.\nIt is also key to point out that chief executive Vinai Venkatesham was integral to Arsenal 's decision to stick with Mikel Arteta during some of the lowest depths of the Spaniard's stewardship at the Emirates.\nArsenal are now widely viewed as one of the strongest teams in European football.\nFrank has some way to go emulate Arteta - but there is currently a willingness to give him an opportunity to lay foundations towards a similar path to success.\nResults, though, will be key towards that continued support. Further disappointments like the one suffered on Sunday and Frank's backing will wane.\nSunday's loss at Forest marked Frank reaching a quarter-century of matches in charge of Spurs. Like England's batters in the Ashes, a ton or even a half-century is far from guaranteed.\nIn his 25 games across all competitions, the Dane has won 10 matches and lost nine.\nThose nine defeats include on penalties against PSG in the Uefa Super Cup, a 2-0 loss to Newcastle in the League Cup, and Premier League defeats including a 4-1 hammering off local rivals Arsenal .\nThis mixed bag of form has seen some supporters pining for the return of former manager Ange Postecoglou, and his often entertaining tactic of 'Angeball'.\nIt was of course the Australian who ended Spurs' 17-year wait for a trophy last season by beating Manchester United in the Europa League final.\nThose supporters may be remembering Postecoglou's first 25 games at Spurs, of which they won 14. This included a stellar start to the 2023-24 Premier League season, when Spurs won eight and drew two of their opening 10 matches.\nBut they may do well to remember the 60-year-old's final 25 games in charge, which included Spurs spiralling to 17th in the Premier League last season - their worst finish since the formation of the league.\nSpurs lost 13 of their final 25 matches, winning nine."
    },
    {
      "id": 11,
      "title": "Where does Old Trafford thriller rank among best Premier League games?",
      "link": "https://www.bbc.com/sport/football/articles/cy47wj05xgqo",
      "content": "When it comes to the greatest Premier League game ever, where do you even start?\nManchester United and Bournemouth served up an eight-goal thriller on Monday, which former Liverpool and England defender Jamie Carragher described as the \"best game\" so far this season in the English top flight.\nSpeaking on Sky Sports, Carragher said: \"That's what makes the Premier League the greatest product in the world.\n\"For the majority of that Manchester United were absolutely fantastic. Bournemouth were not at the races at all in the first half but they were fantastic in the second half. What a game. Brilliant.\n\"I think we have just seen the best game of the Premier League season so far.\"\nThe Red Devils famously played out a 5-5 draw at West Brom in Sir Alex Ferguson's final match in charge of the club in 2013.\nAnd United's 4-4 draw against the Cherries was the 17th time the scoreline has occurred in the Premier League era.\nBut where does Monday's match rank among some of the other remarkable contests we have seen down the years?\nHaving blown a 10-point lead at the top of the table, Newcastle's title hopes suffered a major blow as they lost a classic in stoppage time at Anfield despite having led twice.\n\"Collymore closing in...\"\nIn an extraordinary conclusion to the 2011-12 campaign, Manchester City scored twice in stoppage time to beat Queens Park Rangers on the final day and win their first title in 44 years.\nSergio Aguero's famous late winner ensured City pipped rivals Manchester United , who had already won that day, to the trophy on goal difference.\nOn another remarkable evening at Anfield, Arsenal 's Andrey Arshavin produced a stunning individual display - netting all four goals for the Gunners to deliver a serious blow to Liverpool 's title ambitions.\nArsenal were 4-0 up at and cruising at half-time as they looked to chase down league leaders Manchester United .\nHowever, Abou Diaby was then sent off for the Gunners as Newcastle produced a stunning comeback to earn an improbable draw - with Cheick Tiote's thumping 87th-minute strike clinching the point.\nWith Manchester United having beaten Newcastle to the title the previous season, this felt like payback for Kevin Keegan and his players, who had also suffered a 4-0 reverse to Sir Alex Ferguson's side at Wembley in the Charity Shield just weeks earlier.\nManchester United staged a magnificent comeback from 3-0 down at the break to overwhelm Tottenham at White Hart Lane.\nDean Richards, Les Ferdinand and Christian Ziege all scored for the hosts but a transformed United hit back through Andy Cole, Laurent Blanc, Ruud van Nistelrooy, Juan Sebastian Veron and David Beckham.\nMichael Owen's winner deep into stoppage time gave Manchester United a dramatic victory in a classic derby at Old Trafford.\nThe moment prompted Ferguson to set off on an impromptu wild dance along the touchline, while City boss Mark Hughes - whose side had come from behind three times - questioned why the game had gone on for six added minutes rather than the four allocated.\nLiverpool had gone 2-0 up early on with goals from Sami Hyypia and Christian Ziege, but Mark Viduka scored either side of half-time to drag Leeds level.\nVladimir Smicer restored Liverpool 's advantage, before two goals in three minutes from former Celtic forward Viduka secured an incredible win for the hosts.\nTitle-chasing Liverpool had just lost to Chelsea at Anfield, but looked set to power themselves back into the race when they took a commanding 3-0 lead at Selhurst Park.\nBut they squandered that advantage in a chaotic final 11 minutes, leaving Luis Suarez in tears at the final whistle. Man City went on to win the league by two points.\nA tight pitch, a packed Highbury and another compelling contest between two of English football's heavyweights.\nThe Gunners went two goals up courtesy of Nicolas Anelka and Patrick Vieira only for the champions to draw level thanks to two Teddy Sheringham efforts.\nBut in a season when Arsene Wenger's side were to wrestle the title away from Manchester, David Platt scored the winner.\nEverton are one of only six sides that have never been relegated from the Premier League, but they were on the brink at 2-0 down to Wimbledon in the first 20 minutes of the final day of the 1993-94 season.\nHowever, a Graham Stuart double helped the Toffees preserve their stay in the top division, with his winner coming in the 81st minute, which kick-started jubilant scenes at Goodison Park.\nMost people will remember this game because of the fiery exchange between captains Patrick Vieira and Roy Keane in the tunnel before the game, but the 90 minutes itself were just as thrilling.\nVieira opened the scoring for Arsenal before they were pegged back by an Ashley Cole own goal.\nAnother Gunners legend, Dennis Bergkamp, helped the hosts retake the lead before two goals from a young Cristiano Ronaldo and a delightful John O'Shea chip stunned Arsene Wenger's side.\nA match that meant most for a side that wasn't involved - the day that Leicester City were crowned champions will go down in footballing history.\nTwo first-half goals from Harry Kane and Heung-min Son gave Tottenham hope of chasing the Foxes down at the business end of the season.\nBut Gary Cahill and Eden Hazard scored to get Jamie Vardy and his Leicester team-mates' party started as tempers flared in the second half of a match dubbed the 'Battle of the Bridge'.\nManchester United and Bournemouth played out the latest Premier League classic at Old Trafford.\nThe hosts led three times and thought they had won the game when they scored twice in 129 seconds to turn a 3-2 deficit into a 4-3 advantage.\nBut Eli Junior Kroupi's strike in the 84th minute pegged Ruben Amorim's side back once again as both sides had to settle for a share of the spoils."
    },
    {
      "id": 12,
      "title": "Dominant Sabalenka wins back-to-back WTA awards",
      "link": "https://www.bbc.com/sport/tennis/articles/c1dz64y54keo",
      "content": "World number one Aryna Sabalenka has been voted the Women's Tennis Association player of the year for a second successive season.\nThe 27-year-old won four titles - the most on tour - including retaining the US Open against Amanda Anisimova in September to claim her fourth Grand Slam singles triumph.\nAcross the season Sabalenka played in a tour-best nine finals, with losses to Madison Keys in the Australian Open final in January and Coco Gauff in June's French Open final.\nThe Belarusian also won the Brisbane International in January, the Miami Open in March and the Madrid Open in May , and spent the entire year as world number one, finishing 2025 top of the rankings for a second successive year.\nIn July, she became the first player to top 12,000 WTA ranking points since Serena Williams in 2015.\nSabalenka finished the season with a 63-12 win-loss record, and picked up a record £11m in prize money.\nShe received almost 80% of the votes cast by international tennis media.\nOn 28 December, she will face 2022 Wimbledon runner-up Nick Kyrgios in a Battle of the Sexes-style exhibition match in a bid to \"help bring women's tennis to a higher level\" .\nSwitzerland's Belinda Bencic, 28, has been voted comeback player of the year after taking a 13-month break following the birth of her first child and returning to the sport at the start of this year.\nCanadian 19-year-old Victoria Mboko picked up newcomer of the year after starting the season ranked outside the world's top 300 and climbing to world number 18 .\nKaterina Siniakova and Taylor Townsend were voted doubles team of the year after winning their second Grand Slam title together, while Anisimova was named most improved player of the year after reaching five finals.\nLast week, Carlos Alcaraz took home three honours in the Association of Tennis Professionals (ATP) Awards, including the year-end number one award, while Jannik Sinner was voted fans' favourite for a third time."
    }
  ]
}