{
  "category": "travel",
  "articles": [
    {
      "id": 1,
      "title": "The six best places to ski in 2026",
      "link": "https://www.bbc.com/travel/article/20251218-the-six-best-places-to-ski-in-2026",
      "content": "From Italian Winter Olympic buzz to brand-new wellness retreats in the Canadian Rockies, these six ski areas are trending for 2026.\nAs the barometer drops in the northern hemisphere, skiers everywhere are preparing to shred black diamonds and show off their mountain 'fits. Tried-and-true hotspots like Aspen and Courchevel never lose their appeal, but according to Sara Haney, head of travel for concierge service Velocity Black which organises bespoke skiing experiences for travellers, skiers in 2026 \"want a sense of discovery, not just lift access\".\nThis season, snow reliability also remains a top priority. According to Cat Iwanchuk, vice president of business development at Ski.com , skiers are changing their plans to coincide with optimal snowfall. Favourable early forecasts boost the season's top contenders.\nFrom exciting new openings to the chillest après ski , here are our picks of the six best places to ski in 2026.\nThe Dolomite Mountains, famed for their dramatic limestone peaks and perfect pink sunsets, have traditionally been an \"Italians-only\" ski destination. Thanks to hosting this year's Winter Olympics, ski-related searches from the US have risen 82% compared to the same timeframe in 2024 and up 16% in the UK, reports Herrmann Global Tourism Insights.\nThe focus is mostly on Cortina d'Ampezzo , which will host many of the Games' events, but \"Cortina d'Ampezzo is only but a fraction of the vast Dolomites,\" says Agustina Lagos Mármol, owner of Italian travel operator Dolomite Mountains . The Dolomiti Superski stretches for 3000 sq km, encompassing a dozen different ski areas ( one pass gets you into all 12).\nTo catch the Olympic buzz (without blowing your budget), Mármol recommends exploring other parts of the region, where accommodation is more accessible. Alta Badia , a stunning valley 50 minutes west of Cortina, is up and coming thanks to the July 2025 opening of the 51-room chalet-style luxury hotel Aman Rosa Alpina . Picturesque villages like Corvara (Alta Badia's adventure hub) offer easy access to 130km (81 miles) of skiing. Paired with stick-to-your-ribs South Tyrolean dishes like golasc y polënta (goulash with polenta) at Maso Runch Farm and après-ski bombardini (Italian-style eggnog) at Club Moritzino , you've got all the ingredients for an Italian ski holiday.\nCan a hotel opening define an entire season? The November 2025 debut of One&Only Moonlight Basin just might. Caroline Hansen, trip designer for Indagare , reports the opening \"has put Big Sky even more on the global luxury map.\" In addition to 73 upscale rooms and 19 cabins, the hotel flaunts world-class dining and a stargazing observatory.\nBig Sky's ascent from under-the-radar cult favourite to one of the US' most popular resorts has been a decade in the making, thanks to updated lift infrastructure (from Ramcharger 8's heated seats to weatherproof bubbles) and a hospitality scene glow up. Foodies will love this winter's residency from Chicago's two-starred Michelin restaurant Alinea , and until 31 March 2026, head chef Grant Achatz and his team will run M x Big Sky Resort , highlighting alpine cuisine.\nNone of this overshadows the area's true appeal: 5,850 acres of some of the least crowded slopes in the American West.\n\"Big Sky still feels blissfully untouched by the heavy commercial footprint you see in other mountain towns,\" says Steve Orens, president of luxury travel agency Frosch . \"Once you arrive, the scale and quiet hit you immediately. Also, it's not just for skiers. Think snowshoeing through Yellowstone and horseback adventures.\" Don't miss the DJ-fuelled après at the Village Plaza.\nDespite its location in the heart of the Canadian Rockies, Banff has traditionally been considered a summer travel destination thanks to its hiking trails and crystalline lakes. But this season's expansion plans might be poised to change that.\nOn 17 December 2025, Lake Louise Ski Resort unveiled Richardson's Ridge ; 200 new acres of beginner-, intermediate- and tree-skiing terrain serviced by the high-speed quad chairlift that debuted in 2024. This season also welcomes wellness venues: Basin at the Fairmont Chateau Lake Louise is a 19,000 sq ft indoor-outdoor thermal bath on the shores of Lake Louise, while Everwild is a design-forward new hotel with a Nordic Spa in Canmore. But to experience the region's rugged roots, head to Rose & Crown , a 40-year-old local favourite with nightly live music.\nFor Iwanchuk, what makes Banff best-in-class is the snow. \"The combination of a location far north and high altitude means that snow conditions are typically among the best in the world,\" she explains. \"You can feel confident booking in advance.\"\nTwo of Banff's ski areas – Banff Sunshine Village and Lake Louise Ski Resort – had such promising early snowfall that they were the first Canadian resort to open for the 2025-2026 season.\nFrom 2024 to 2025, Niseko, a town in Japan's northernmost Hokkaido region known for its fluffy, plentiful \" Japow \" (Japan powder), had a record-breaking season, welcoming more than 11 million visitors. Interest in skiing in Japan continues to grow , but ski travel advisor Alli Widman of The Avant Ski champions the lesser-known village of Furano, which has a 28-run ski resort located about two hours east of Sapporo. Its season started with a bang, receiving 190cm (75 inches) of snow as of 15 December 2025. \"By August this year, I had booked more Furano trips than in any previous season,\" Widman reveals.\nMore like this:\n• The Swiss ski resort reinventing winter\n• The ski resort Olympians flock to each summer\n• Skiing Mount Etna, Europe's tallest and most active volcano\nPair mornings on the mountain with a bowl of spicy Hokkaido soup curry at Furanoya or try the area's traditional post-ski treat at a Hokkaido-style ice cream making class at the Furano Cheese Factory . Given Furano's size (just 415 acres), Widman often builds multi-mountain itineraries, adding Asahikawa and Mt Asahi-dake, Hokkaido's highest peak with \"incredible backcountry access\".\nOrens recommends an island road trip from Niseko to Iwanai and then to Rusutsu. \"Each stop gives you a completely different view, snow and feel,\" he says. \"At Iwanai Resort , you can go snowcat skiing straight into untouched powder, and in the mornings, they'll hand you hot coffee and doughnuts before you even clip in. Rusutsu caps the trip with some of the area's most consistent snow.\"\nIn the French Alps, Chamonix, Val d'Isere and Courchevel get the most attention, but this year, train your skis towards Méribel, which makes up one-third of the Les 3 Vallees ski area. This quaint ski town with wood chalet architecture has access to 600km (373 miles) of trails, a lively après-ski scene (slopeside cabaret at La Folie Douce , anyone?) and gorgeous views of the Les Allues valley.\n\"We've seen a significant uptick in Méribel enquiries this season – around 50% more interest than last year,\" says Nickie Mabey, founder of Mabey Ski . She adds that snow reliability comes with \"a more grounded, authentic Savoyard feel [for guests who] want private mountain guides who know which refuges serve the best hay-matured raclette, torch-lit forest dinners and wine tastings with local sommeliers\".\nThis season, the Côte Brune lift, which connects Meribel to Val Thorens, has been updated into a lightning-quick 10-person gondola. Forty-year-old Les Rhodos , too, has been given a €10m (£8.7m) makeover, and a new green run debuts at Rhodos mid-station to the Rond Point. The First Track experience will be taking place every Wednesday from Roc de Fer, a World Cup downhill ski course.\nEager to extend the snow-cap fantasy beyond March? Head to Queenstown, home to one of the world's longest winter sports seasons, stretching nearly five months from June to October. Four distinct resorts – all within a short drive of the city's downtown – offer beginner-friendly tracks, freestyle parks and plenty of backcountry fields. Winter 2026 also marks the first full season of the Soho Basin expansion , which added another 370 acres to the Cardrona Alpine Resort trail map, making it the country's largest commercial ski resort.\nROKI Collection , a luxury hotel that opened on the banks of Lake Wakatipu on 1 September 2025, is within striking distance of the slopes on The Remarkables ski area. Queenstown's winter season is also full of events, including the 10-day Winter Pride in August – the Southern Hemisphere's largest LGBTQIA+ winter festival.\n\"I think people tend to approach Queenstown differently,\" Mabey says. \"It's often booked as part of a broader New Zealand winter trip. The town itself is such a major draw with adventure activities, wine regions and that stunning lakeside setting that skiing becomes one element of a multi-faceted holiday.\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 2,
      "title": "Turkey's ornate Ottoman-era 'bird palaces'",
      "link": "https://www.bbc.com/travel/article/20251217-turkeys-ornate-ottoman-era-bird-palaces",
      "content": "Many of Istanbul's visitors are unaware that the city is home to half-a-millennium-old stone-carved bird houses that reflect the Ottomans' reverence for the animals.\nOn a corner lot in Istanbul's old city, there's what some might call a fixer-upper: a stone-built duplex with gabled roofs and lots of windows. Parts of its exterior walls are crumbling, but there's a unique feature affixed to its walls that makes it a perfectly fine home for its many residents – the city's birds.\nToo grand to be called mere birdhouses, dozens of masterfully stone-carved kuş sarayları (\"bird palaces\") or kuş köşkleri (\"bird pavilions\") in varying states of repair are perched under the eaves of Ottoman-era mosques, tombs and other structures in central Istanbul. Largely built between the early 16th and 19th Centuries, these intricately designed relics of Istanbul's past largely go unnoticed by the city's nearly 16 million human residents, despite their cultural, historical, religious and ecological significance.\n\"Each bird palace has its own unique architectural style and detailed beauty that also represents a thoughtful display of compassion,\" says Öykü Demir, an Istanbul-based tour guide who took a special interest in the structures after spotting them on the walls of various historical sights.\nCharity is one of the five pillars of Islam, and in Ottoman times, this extended to animals across the empire . Religious foundations were endowed to feed strays or treat wounded creatures, and small basins were cut into cemetery stones to collect rainwater for dogs, cats and birds to drink. While horses, camels and donkeys played vital roles in transportation, and dogs were valued as neighbourhood guardians, birds held a special place within the empire because they were symbolically linked to the soul reaching for the heavens.\n\"In Istanbul, you often find birdhouses on the qibla walls of mosques (those facing Mecca) so the sound of birds becomes associated with the sound of prayer, with both human voices and birds' voices fluttering up to the sky,\" says Christiane Gruber, a professor of Islamic art history at the University of Michigan.\nMore like this :\n• Catstanbul: Inside the city where cats rule the streets\n• A chef's guide to the best food in Istanbul\n• Istanbul's plan to save its cultural soul\nIntegrating birdhouses into the construction of official buildings is believed to date back to the Seljuk Empire, a Sunni Muslim dynasty that preceded the Ottomans by some 200 years and stretched across Central Asia into modern-day Turkey. The earliest-known examples beginning in the 13th Century were simply small holes carved into high parts of a building's facade to allow small birds like sparrows, swallows and finches to nest undisturbed. But by the early 16th Century during Ottoman rule, some of these avian sanctuaries had started to resemble miniature versions of the architecture of the time, often carved from leftover material used to build the main structure.\nThe practice reached its creative peak during the 18th Century, a period of prosperity in which there was a new emphasis on public space and leisure. During this time, Ottoman art and architecture transformed under the influence of the Baroque and Rococo movements from Europe. \"This style was ascendant globally. You could find it in Goa, in the New World, in the Middle East,\" says Gruber. \"In Turkey, the Ottoman Baroque was called 'the new style' and emphasis was placed on novelty and creativity, on new kinds of stonework in a florid style.\"\nThis era yielded such flights of architectural fancy as the gabled, opulent bird dwelling on the wall of the Imperial Mint near Topkapı Palace , adorned with a trio of cupola roofs, miniature staircases and delicate latticework on its balcony railings. Other notable examples that are still in good condition include two bird houses on the wall of the Yeni Valide Mosque in the Üsküdar district that are themselves shaped like small mosques, each complete with a pair of minarets.\nWhile bird palaces have been documented all around Turkey, from the western city of Edirne, a former Ottoman capital, to the cities of Van and Doğubeyazıt in the country's far east, Istanbul seems to have been their main showcase.\n\"There were many stonecutters in Istanbul at the time, so these [bird houses] may have functioned like maquettes or models, as a way to experiment with form, though not all of their designs would have been implementable on a real scale,\" says Gruber. \"As an opportunity for stonecutters to showcase their mastery and their skills, they were in a way acting as business cards as well.\"\nAs visually delightful as these compact constructions are, they were also very practical, encouraging birds to perch and nest in these designated areas rather than in places where their activities might damage the buildings. And according to ecologist and birder Kerem Ali Boyla, they were highly functional avian habitats as well.\n\"I think the people who made them really thought about them, about the size of the opening, and whether it faced to the south or the north, which is important in terms of heat control and protection from the wind,\" says Boyla. \"The birdhouses many people put up today have entrances that are too big – they don't realise how small birds are under their feathers – which means that larger birds like crows can raid the nests.\"\nDespite being a densely populated megacity, Istanbul is still rich in birdlife, with nearly 300 different species spotted in the city by birdwatchers this year alone. It sits along major migratory routes between Europe and Africa, bringing formations of white storks gliding over the Bosporus and starling murmurations swooping through the skies over Taksim Square. A resident grey heron colony nests in the tall plane trees of Gülhane Park, and a dozen different species of seagulls dart in the wake of the city's ferries .\nGruber speculates that the Ottoman bird houses may have been a form of \"atonement\" for clearing forested or marshy habitats to construct mosques, bridges and other buildings at that time. But in a modern era where development pressure on nature is stronger than ever, these old sanctuaries are disappearing along with open space.\n\"Bird palaces were generally made of soft küfeki stone [a type of local limestone], which wears down over the years due to factors such as rain and wind,\" says Demir. Many now are so eroded that only a suggestion of walls remain. Others are obscured behind fences or later construction, and only a scant few new ones have been built since the 19th Century, likely due to a parallel decline in hand craftsmanship and evolving ideas about urban wildlife that came along with industrialisation and modernisation.\n\"These bird houses represent a very old tradition of hospitality, and an idea… that says the city belongs not just to humans,\" says Gruber. \"They reveal a different way that people related to the environment in the past and might give us a blueprint for ways to reconcile that relationship in the future.\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 3,
      "title": "How convenience store socks became Japan's coolest souvenir",
      "link": "https://www.bbc.com/travel/article/20251209-how-convenience-store-socks-became-japans-coolest-souvenir",
      "content": "A simple pair of striped socks from Japanese convenience stores has become a global cult item. But how did an everyday essential turn into the souvenir travellers seek out?\nI am on the hunt in Tokyo. But instead of seeking out a steaming bowl of ramen or a neon-lit street corner, I'm prowling convenience stores for seasonally available socks.\nSomehow, an everyday essential has become one of Japan's unlikeliest cult souvenirs, drawing expats, travellers and TikTok creators alike. Sold for as little as ¥390 (about £2), these \"conbini socks\" now top shopping lists, spark social-media challenges and even inspire full clothing lines. And like so many other visitors, I'll be leaving with a suitcase full.\nPerhaps it was only a matter of time before convenience stores, or conbini as they're affectionately known in Japan, became fashion hubs. While in much of the world convenience stores are places to grab a greasy snack, in Japan they've evolved into a one-stop-everything shop. The reputation began in the 1970s when more women entering the workforce meant a rising demand for easy-to-eat dinner options, and was solidified as additional services were added, like the ability to buy concert tickets, pay bills or even just the opportunity to use clean bathroom or free wi-fi.\nSo when national conbini chain FamilyMart launched their Convenience Wear line in 2021, with socks, bags and underwear, locals barely blinked. One item, however, immediately stood out: \"Line Socks\", calf-height white tennis-style socks featuring two blue and green stripes modelled after the FamilyMart store logo.  The socks became so popular that FamilyMart opened Famima!, a small clothing-and-lifestyle shop inside Tokyo's Blue Front Shibaura building – where there's also a regular FamilyMart a few steps away.\nBut FamilyMart isn't alone in the convenience-store sock market. Rival conbini chain Lawson partnered with Japanese designer Muji in 2021 to release two striped styles: a pink and blue pair that mimics the Lawson sign; and a navy-and-white pair inspired by store worker uniforms. During this year's Osaka expo, 7-Eleven sold limited-edition orange, green and red striped socks made from \"Ovoveil\", an upcycled eggshell membrane.\nThe streetwear trend is strong in Japan, and wearing socks convenience store socks has the same energy as a Supreme t-shirt or A Bathing Ape hoodie, albeit at a far more impulse-friendly price point.\nThe Line Sock's rise to cult status began during Japan's post-Covid border restrictions, when they became an unexpected hit with expats. J-Fashion designer Mikan Mandarin , founder of Vina of the Valley, found herself unexpectedly swept up by the trend, even though it didn't match her kawaii (cute) style.\n\"It was one of those things that anyone could wear,\" she said. \"And I think that's why it had the appeal that it did. The world was closed off, so it felt nice to have a little sense of community.\nThe iconography soon seeped into internet culture, topping local bloggers' Japan shopping lists, and, for American vloggers in Japan Megan and Ben – aka Hito Bito – creating a fun universal talking point. They describe buying FamilyMart socks as a \"a rite of passage\" for most expats in the country – and the sock even inspired them to create a social media video where they challenged themselves to create an entire outfit sourced from FamilyMart.\n\"They're kind of iconic in the same way carrying around a blue Ikea bag as a purse is,\" they said. \"If you get a well-stocked convenience store you can find plenty of good options.\"\nWhen Japan's borders reopened in October 2022 and visitor numbers quickly began to surpass pre-pandemic levels, travellers quickly adopted the socks as must buys. Long-standing fascination with Japan's convenience stores meant many visitors were drawn to the idea of taking home a small souvenir, and the product fell in line with Japan's tradition of affordable, everyday design objects – think well-made chopsticks, cotton yukata or anything Muji.\nAnd in a nation where shopping culture thrives and shops like Don Quijote and Bic Camera do brisk business in suitcases for those who have over-shopped, socks became an easily packable addition to the traveller's haul, offering a slice of modern Japanese iconography at a budget-friendly price.\nThat's why Reginal Hakizimana, founder and managing director of Enclose Africa Safaris brought home multiple pairs home from a trip to Japan, both for friends and himself.\n\"FamilyMart and Lawson's socks remind me of specific cultural aspects of Japan,\" he said. \"These aren't just goods that say 'Made in Japan'; rather, they're part of the everyday items within reach at convenience stores, and that establishes their realness. They are compact, lightweight, inexpensive, practical and best of all, they bring back memories. They encapsulate the warmth, thoughtfulness and creativity of Japan.\"\nIt made sense that variations on the \"Line Sock\" theme would soon follow. Anyone who has developed a fondness for a seasonal snack knows the speed with which FamilyMart rotates their limited-edition products – and the same logic has shaped its sock collection.\nThe chain now releases both calf- and ankle-length designs in seasonal colour palettes, plus one-off collaborations with major pop-culture franchises, including Stranger Things, The Simpsons and the Fuji Rock Festival. Nippon League baseball teams Hiroshima Carps, Yomiuri Giants and Fukuoka SoftBank Hawks have also received regionally available Line Sock editions, as did FamilyMart's signature fried chicken, Famichiki.\n\"Emphasis is placed on either 'global brands' or 'local community focus',\" said Kaori Iori, Public Relations FamilyMart Co Ltd. \"Such partnerships generate substantial buzz and serve as an opportunity to attract new fans to Convenience Wear.\"\nMore like this:\n• The unique culture of Japanese convenience stores\n• How sleeping in old schools is reviving rural Japan\n• Who drank all the matcha? How tourism drained a Japanese town\nAmong Japanese consumers, conbini socks remain a practical item: something you buy because you forgot a spare, or because a limited-edition collaboration catches your eye. Yet FamilyMart's sock sales have now exceeded 30 million pairs, finding fans across the globe. Yunna Takeuchi, co-founder of City Unscripted, grew up in the UK with a deep understanding of Japanese language and culture. On her first visit to Japan, she noticed that the socks felt aligned with the culture she had experienced at home.\n\"Sold in convenience stores, these socks tell you one thing about the nature of Japanese design: it combines utility and elegance in a single piece,\" she explains. \"So, what I did was take one drawer of these socks per season in order to distribute them to friends who are interested in Japanese culture.\"\nAs Convenience Wear continues to expand its collaborations, the Line Sock shows no sign of losing its grip on travellers' imaginations. Visitors are seeking a sense of life in the country, and memories of the small moments of travel. In that way, what could be more fitting than a humble pair of socks?\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 4,
      "title": "Where are all the Canadians going?",
      "link": "https://www.bbc.com/travel/article/20251211-where-are-all-the-canadians-going",
      "content": "In recent years, one in four visitors to the US has been Canadian. But with so many boycotting US holidays, here's where they're heading instead.\nIn response to US President Donald Trump's sweeping tariffs on Canadian goods – and his suggestions that Canada should become the US's 51st state – many Canadians have embraced the nation's unofficial \"elbows up\" motto, a hockey term that implies punishing the opposition. A growing number have cancelled upcoming trips to the US, and as Canadians' boycott of US travel extends into its 12th straight month, the trend sees no signs of slowing.\nFor years, Canadians have been the biggest source of international visitors to the US, making up 28% of foreign tourists in 2024 . But that figure has dropped dramatically since January 2025. According to the US Travel Association (USTA), inbound Canadian travel to the US is down 23% year-to-date (Jan-Oct), which equates to an estimated $4bn (£3bn) loss compared to the previous year. The organisation says roughly four million fewer Canadians have visited the US so far this year.\nBut Canadians are travelling more overall. That begs the question: where are they going instead?\nMany, like travel writer and content creator Emilie Brillon, say they have decided to follow national calls – including from former prime minister Justin Trudeau – to support Canada and explore more of their own country.\n\"I used to cover road trips across both Canada and the US,\" said Brillon. \"But last March I made a conscious shift to focus solely on Canada. We even cancelled a planned family trip to the Grand Canyon in April 2025 and chose to redirect that budget into the Canadian economy instead.\"\nMore like this:\n• The Canadian mountains where heli-hiking was born\n• The stunning Canadian island you can see but not touch\n• Why some travellers are avoiding the US\nToronto-based publicist Tracy Lamourie says she used to travel to the US regularly but was blunt about her plans moving forward: \"[I'm] never crossing the border again,\" she said. \"[I] switched to Europe for travel and Zoom for meetings. [Between the] 51st state rhetoric and human rights abuses – while it never seemed safe – now it's on the no-go list.\"\nLamourie's stance reflects a broader sentiment, as many international travellers have been rethinking their US travel plans this year – a trend that the USTA estimates will cost the US $5.7bn (£4.28bn).\nAccording to Statistics Canada , the country's central statistical agency, domestic travel within Canada has surged in 2025, alongside increased Canadian travel to Mexico, Portugal, the Bahamas and Belize. The agency reports a nearly 12% rise in Canadian visitors to Mexican cities year to date. Data also shows that Canadian spending in destinations like Buenos Aires, Osaka, Copenhagen and Curacao was up more than 100% this summer compared to 2024.\nMeanwhile, US destinations that typically rely on Canadian tourism are feeling the impact. Between January and July, 30% fewer Canadians crossed the border into Vermont compared to the same period in 2024. Las Vegas has seen an 18% year-to-date decline, and places like Ft Lauderdale , Upstate New York and many other regions are experiencing similar downturns.\nAn increase in flight connectivity to Europe and the Caribbean is making it easier for Canadians to bypass the US. \"From Canada to Berlin, Ponta Delgada, Nantes and Brussels, we are strategically increasing new non-stop routes across Europe to bring convenient access to key destinations, while strengthening economic ties and supporting tourism,\" Air Canada executive vice president and chief commercial officer Mark Galardo said in a statement .\nFrom 4-20 December, the airline is also launching 13 new routes to the Caribbean, Central America and South America – a move that is likely aimed at Canadian \"snowbirds\" who previously relied on US states like Florida or California for winter sun.\nJust how long Canadians will continue to avoid travel to the US is uncertain. But Brillon believes the shift could reshape Canadian travel patterns for years to come.\n\"I think the real opportunity is encouraging Canadians to explore lesser-known regions [of our own country], for example visiting the Kootenays instead of Banff ,\" she said. \"From what I'm seeing, this doesn't feel like a short-term thing; it's starting to look like a longer-term shift in how Canadians choose to travel.\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 5,
      "title": "How your lost bag ended up for sale in Alabama",
      "link": "https://www.bbc.com/travel/article/20251212-unclaimed-baggage-the-store-that-sells-your-lost-luggage",
      "content": "Everyday, thousands of travellers come to a town in Alabama to sift through lost bags filled with everything from wedding dresses to medieval suits of armour.\nIf you're among the many millions of travellers boarding a flight in or to the US this holiday season, there's a more-than-99.5% chance you'll be reunited with your checked bag at your destination's baggage claim – or, if it's misplaced, within 90 days through your airline.\nBut if you're one of the rare few who never sees their suitcase again, it's likely your meticulously packed belongings ended up in Scottsboro, Alabama, and will soon find new homes courtesy of the many treasure-hunting shoppers at Unclaimed Baggage : the nation's only lost-luggage retailer.\nGrowing up a few hours' drive away in Georgia, I'd heard stories about Unclaimed Baggage – a mystical spot where lost bags, seemingly gone forever, reappear. I knew the company has long-term agreements with all the US's major airlines to purchase baggage (checked and carry on) that goes unspoken for on that fateful 91st day, when, after airline compensation, ownership of your favourite travel outfit, prized accouterments and family heirlooms is officially severed.\nThe contents of those unclaimed suitcases, if deemed saleable, are then sorted and priced up to 80% off retail before becoming part of the more than 7,000 \"new\" items on the store's massive 50,000-sq-ft floor each day.\nIn 2024, around 500 million pieces of luggage were checked onto American flights, with another 2.1 billion bags carried on. Even before factoring in that Unclaimed Baggage also has contracts with bus lines, cargo companies, trains, rental car companies and hotels, I was overwhelmed imagining the volume.\nSo, I decided to drive to Scottsboro, a town of 16,000 people in Alabama's north-western corner where the Appalachian foothills meet the Tennessee River. I wanted to meet a few of the thousands of visitors who flock here everyday and understand how this unlikely place came to be.\nThe car park was nearly full at 08:00 on a recent Saturday morning. I pulled into a space between cars with New Mexico and New York licence plates and followed a group of older shoppers shuffling into the sprawling, city-block-sized building. As each entered, their backs straightened, smiles widened under the fluorescent lights and they beelined for the shopping trolleys.\nInside, racks of clothes – divided by category, size and gender – extended out of sight across the store's football field-sized expanse. A cornucopia of other peoples' dresses, shorts, suits, gowns, belts, hats, skirts, scarves, jeans, puffy coats, activewear, T-shirts and silk pyjamas surrounded display cases of rings, necklaces, bracelets, earrings, watches, sunglasses, perfume and cufflinks. The mezzanine was dedicated to lost phones, headphones, chargers, gaming systems, e-readers, tablets, laptops and cameras. Elsewhere, shelves were stuffed with sneakers, wingtips, boots, pumps, slippers and flip-flops.\nOh, and the brands. Unlike thrift stores, which are filled with items their owners no longer want, Unclaimed Baggage's merchandise comes from travellers who – according to Jennifer Kritner, the company's vice president of retail and company culture – often pack their trendiest belongings for their holiday. Consequently, hunters dug through rows filled with Patagonia, Burberry, Rolex, Apple, Cartier, Louis Vuitton, Gucci and Bulgari items.\nKritner joined me as I wandered through the store. When we found ourselves in front of a wall of wedding dresses, I asked her about the emotions and personal connections associated with the inventory surrounding us.\n\"We all lose [things] sometimes,\" said Kritner, who is also director of the company's Reclaimed for Good Foundation , which gives about one-third of incoming items to charitable organisations. \"Our goal is to do the best with what comes in… some [items] are sold, some are donated to those in need and some are recycled. But they all receive a second life. The question, really, is: 'What is on the other side of loss?'.\" She paused. \"Being found.\"\nIn April 1970, Doyle Owens, acting on a hunch, borrowed $300 and a Chevy truck and drove from Scottsboro to Washington DC to purchase his first haul of 110 bags from the Continental Trailways bus company. In a video recounting the event, Owens, who passed away in 2016, remembered feeling like The Beverly Hillbillies as he rolled back to Alabama in the overburdened pickup. But after selling out that initial load – spread out on sawhorse tables in a rented house – he was already looking for the next payload. Unclaimed Baggage was born.\nAbby Gentry Benson, a lifelong Scottsboro resident, was there for that first truckload. \"When they opened the doors, there was a line of my mama and her friends,\" she told me. \"I still have a little jade ring we got that very first day.\" I asked Gentry Benson, who was searching, as she does every visit, for Chanel perfume, what draws her back. \"You don't know what you're gonna get,\" she said. \"I come several times a week – sometimes twice a day. For me, it's like retail therapy.\"\nOwens sold the business to his son Bryan in 1995. It was precipitous timing. The same year, Oprah Winfrey featured Unclaimed Baggage on her show as a \"best-kept shopping secret\".\nIt's no longer a secret. More than a million people per year make the pilgrimage to shop here, and Alabama Tourism even lists Unclaimed Baggage among the state's attractions . People come for the valuable, weird and practical items that once held a pride of place in someone else's closet. Like Gentry Benson, they come to test the store's motto: \"You never know what you'll find.\"\nOver coffee at the in-store cafe, I asked Sonni Hood, Unclaimed Baggage's senior PR and communications manager, something that had been gnawing at me: \"Why aren't there other stores like this?\"\n\"We have contracts with the airlines, but it's really about relationships built over 55 years,\" Hood said, as a shopper passed with a trolley full of cycling gear. \"And with 300 employees, the level of care here is hard to replicate. Every single thing has to be unpacked, untangled, cleaned, researched, professionally appraised and authenticated (we never sell knock offs), and divided into sell, donate or recycle. If it goes online [for sale on our website], it also has to be photographed, described, listed and shipped. We launder 100,000 items per month – it's the largest commercial laundry in the state.\"\nI followed Hood to the middle of the store where a crowd had gathered for one of the daily \"Unclaimed Baggage Experiences\", when a lucky shopper gets to unpack a fresh case. (The bags are inspected ahead of time so there's nothing illegal or naughty inside.) Donning blue latex gloves, a woman from Georgia pulled out items while a growing gaggle of onlookers, each with laden carts, chimed in about which items should be sold, donated or recycled based on their level of wear and tear, and about the type of traveller they represented. \"Oohs\" and \"aahs\" accompanied the unveiling of slacks, designer T-shirts, a vintage Pac-Man game and a glass serving platter. The consensus: he was well dressed and quirky.\nI then wandered to the onsite Unclaimed Baggage Museum , which opened in 2023 and displays more than 100 of the most unique items uncovered over the years. Among them: a basketball signed by Michael Jordan, Amazonian shrunken heads, a 3,500-year-old Egyptian burial mask and a medieval suit of armour. Over the years, employees have unpacked a 40-carat emerald hidden in a sock (sold for $14,000), a platinum Rolex that retailed for $64,000 (sold for $32,000) and a live rattlesnake (unsold).\nIt dawned on me there was more happening here than simple consumerism. There's an archaeological aspect. A thrill-of-the-hunt search for the bizarre and unexpected.\n\"There's no typical shopper here,\" said Bryan Owens, Unclaimed's owner and CEO. \"We have everyone from millionaires to blue-collar workers and we love them all. There's not really a demographic. It's more of a psychographic.\"\nAs I walked around the store, testing my own archaeological instincts (my dig unearthed a new-ish Patagonia jacket, 50% off retail), I met Dian H, an Unclaimed regular for decades. After boasting that everything she wore or carried was found here – shirt, shoes, trousers, necklace and Peruvian tapestry bag – she pulled another recent purchase out of her bag: a 28cm Art Deco statue forged in France in 1930 and valued at nearly $2,000. She paid $2.99.\n\"When I find something like this,\" Dian said, admiring her treasure, \"it reminds me why I love coming here: for the passion of owning something so special for a little while. And look at me. I've got a Peruvian purse. I have a French sculpture. Why would I need to travel?\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 6,
      "title": "Why passport stamps may be a thing of the past",
      "link": "https://www.bbc.com/travel/article/20251218-the-end-of-a-time-honoured-travel-tradition",
      "content": "The process of handing your passport over to a border agent and getting a stamp that signals your arrival in a new nation may soon be a thing of the past.\nIn October 2025, the European Union began rolling out its Entry/Exit System (EES ), a new digital border-management tool that records biometric data as well as entry and exit dates of non-EU nationals travelling in and out of the Schengen area. Once fully implemented in April 2026, the system will replace manual passport stamping with digital screening, making the process more efficient and secure – and marking a significant shift in how some travellers cross European borders.\nThe change is part of a broader global trend. Countries like Australia, Japan and Canada already use biometric data at border crossings, while the United States has announced plans to expand similar systems. As digital processing becomes the norm, it could quietly spell the end to a time-honoured travel ritual: collecting passport stamps.\n\"Versions of passport stamps go all the way back to the Middle Ages or Renaissance,\" said Patrick Bixby, a professor at Arizona State University and author of License to Travel: A Cultural History of the Passport . \"[A wax seal] would be put on letters of conduct by sovereigns in Europe. That's kind of the beginnings, least as far as I'm concerned.\"\nWhile travel documents – and stamps of some kind – have existed for centuries, it wasn't until the early 20th Century that modern passports began to take shape . After World War One, the League of Nations helped formalise passport standards as borders became more tightly regulated.\nBy the 1950s, the more modern tradition of receiving passport stamps had become markers of mobility and status as the world entered the \"golden age\" of travel, when flights became more accessible to the general public.\n\"[It was] really only after World War Two and the resumption of international travel [that] the stamps begin to take on the kind of sentimental value that they have now,\" said Bixby.\nMore like this:\n• Seven travel trends that will define 2026\n• How your lost bag ended up for sale in Alabama\n• Where are all the Canadians going?\nWith the possibility of stamps disappearing, reactions among travellers are mixed.\n\"I'll genuinely miss passport stamps,\" says Hristina Nabosnyi, who lives in London. \"For me, they've always been more than just proof of entry – they're little memory markers of places visited and countries I travelled to.\"\nNew York-based writer Elle Bulado agrees. \"Losing passport stamps feels bittersweet. Although I recognise the need for quicker and more effective processes, receiving a stamp has always felt like a little acknowledgement,\" she said. \"It's evidence that you crossed a border and arrived somewhere you could only dream of. I will miss that custom if stamps vanish.\"\nOthers are more pragmatic. Jorge Salas-Guevara, president and founder the tour company New Paths Expeditions , is excited about how much time the new digitised process could save. \"I spend about 250 to 300 days a year on the road, crossing borders constantly, so for people like me this change is a relief.\"\nThough some travellers will miss the nostalgia of collecting passport stamps, many have plans to mark their travels in other ways instead, such as collecting fridge magnets or other souvenirs.\nStill, for Bixby there will always be something special about having a tangible record of your travels. \"This is [really] a bigger question about analogue versus digital,\" he said. \"There's something about having [a document] that was with you when you were there. [It creates] a kind of aura around the physical object that dissipates when everything becomes digitised.\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 7,
      "title": "Can we save travel's most beloved tradition?",
      "link": "https://www.bbc.com/travel/article/20251210-can-we-save-travels-most-beloved-tradition",
      "content": "Digital communication and social media let us stay in instant touch when we travel, but snail-mailed postcards are still uniting travellers.\nIt was a sweltering morning on the Thai island of Koh Chang and I was sitting at a cafe, sweating over a small, rectangular piece of cardboard. My eyes had zeroed in on it, shelved on a dusty postcard rack in the corner, while walking past, juggling a plastic container of sticky rice and diced mango. I'd been searching for days for one to send to my best friend in North Carolina – our custom for more than 10 years, since her family moved away when we were in secondary school.\nI'd plucked my favourite image from the rack, a shot of the white-sand beach where I was staying, paid for the card and a stamp, scrawled a message in purple marker, then slipped it into the red postbox stationed outside on the island's main street. In less than five minutes, and for around ฿50 (£1.13), I had continued our beloved tradition; linking us across continents and time.\nMy friend and I are part of an increasingly rare breed. The instant nature of digital communication, including the ability to send a \"wish you were here\" text or upload a carousel of photos to social media, has relegated snail-mailed postcards to a bit character in the theatre of travel. Call it a sign of the times: the US Post Office is currently $15bn in debt and has lost more than $9bn in 2025 alone. First-class post, which includes letters and postcards, has declined by 50% in the last 15 years in the US and is expected to decline an additional 29% in the next decade. In 2024, Americans sent roughly 325 million stamped cards and postcards , a staggering decline from the more than 2.7 billion sent in 2000. In Denmark, the country’s state-run postal service PostNord announced earlier this year that it would end letter deliveries by the end of 2025. Citing a 90% decline in letter volumes since 2000, the country has started removing its iconic red post boxes, ending a 400-year-old legacy.\nTo many, postcard-sending has become a relic of a bygone era. But while this retro travel tradition may be endangered, it is still quietly doing what it has always done best: uniting loved ones. Calls to save postcards have been spreading across social media channels like TikTok and Instagram , where the hashtag #postcard calls up 6.5 million posts announcing swaps and tips for card decorating. It's clear that travellers, from baby boomers to millennials to Gen Z, are still using them as a way to engage with their loved ones in a more purposeful way.\nPostcards came into existence in the mid-19th Century, alongside the developing tourism industry. As an entire economy was being built around travel experiences, postcards quickly became popular as a cheap and easy way to communicate, explains Jordan Girardin, a travel and tourism historian. Early postcards featured a visual with a small space for a message on the front; the back dedicated to a stamp and address. \"Postcards were meant to promote the tourism experience,\" says Girardin, a millennial who sends postcards to family members when travelling. \"It had a lot to do with publicity, advertising a certain place with a certain reputation… having a visual effect was really, really important.\"\nIn the UK, some 75 million postcards were sent in 1871, and by 1910 the country was sending more than 800 million a year. The postcards we know today, with an image on one side and space for a message and address on the other, appeared in the early 20th Century, jump-starting what was known in the US as the \" Golden Age of Postcards \"; a craze of collecting and mailing postcards that lasted between 1907 and 1915. By 1913, Americans were sending more than 900 million a year.\nSan Francisco-area artist Ginger Slonaker, a baby boomer who came of age when postcards were still the quickest – and cheapest – means of sharing travel experiences, remembers how bars, restaurants and art galleries used to literally gave them away. When living overseas, she wrote and sent several a week to her parents and mother-in-law. \"I just wanted [them] to be a little slice of what's happening in my life,\" she explains. \"Receiving a postcard was special… because they were associated with travelling to a new place.\"\nFast-forward to the rise of the internet in the 1990s, and postcards began losing their appeal – but not for all. While Slonaker now sends more texts than postcards, she still posts a few to friends every month. After all, texting can only go so far: \"Certainly your personality doesn't come across. And how many times can you send a smiling emoji?\"\nMelissa McGibbon, a millennial travel writer and editor who has been sending postcards for 30 years, calls them the \"best souvenir. Everyone has the impression that it's gone out of style and that not a lot of people are doing it anymore. However, I think there's still a lot of us out there.\"\nMcGibbon, who has visited nearly 60 countries and almost all 50 states, has haggled for postcards in a Cairo bazaar, hunted for them near Tokyo's Shibuya Crossing and even posted them from the Galápagos Islands and Antarctica. What started out as a childhood ritual shared between her and her grandparents has ballooned; over the years, she's created a 75-person-long list of travel pen pals. \"It's a very affordable way to say, 'I'm thinking of you',\" she says. \"It kind of gives me a purpose, like a mission, to hunt for a postcard for every place that I go to.\"\nFor millennial travel writer and content creator James Barrett, postcards are \"kind of like a time capsule. [They're] the perfect gift to show that you're thinking of someone while on vacation without taking up too much space in their home.\" Barrett, who has been to all seven continents, always sends postcards to his boyfriend and family members when he travels, whether it's from far-flung destinations like Fiji and Churchill, the polar bear capital of the world, or Greece and Disneyland. He'll also occasionally send one to himself if the destination is particularly special. \"There's so much more impact to simply getting a postcard than a text message. It's arguably the most thoughtful gift someone can receive,\" he says.\nIn a time when social media is an oversaturated platter of picture-perfect snapshots and curated moments, the tangibility of putting pen to paper to share quiet moments with loved ones has never been so profound. For Sofía Korous Vázquez, a freelance creative and interpreter, this is the humble postcard's exact appeal.\n\"It offers something more intentional, communication-wise. These days, because of the immediacy of messages and the urgency culture around it, it feels less intimate,\" she says. \"There's something romantic and fun about keeping that tradition alive.\" Vázquez, who is Gen Z, first started writing postcards as a child to her baby boomer grandparents. Today, she sends them to her friends.\nShe believes her generation may not send postcards as often as millennials or baby boomers do, but they still hold appeal, as documented on social media and seen through projects like Postcrossing , a global postcard exchange programme with more than 800,000 members in 210 countries; now in its 20th year. \"An email quickly gets lost in the deluge of emails we get,\" says Postcrossing founder Paulo Magalhães. \"But a postcard? It stands out – and immediately wins the placement on the fridge door or on our desks.\"\nDespite the joys of receiving and sending postcards, today the ritual comes with challenges. McGibbon has noticed that the simple act of locating a mail-worthy postcard can be difficult. She believes that if souvenir shops prioritise selling aesthetically pleasing postcards and stamps, more travellers will become invested in the practice. \"It would be a gold mine,\" she says.\nThe lack of funding wracking the global post office system has also left travellers like Vázquez and Barrett leery of sending postcards from abroad. Barrett usually mails his postcards when he returns home to the US, or in some cases will hand-deliver them. \"I'm a bit paranoid, I'd rather just make sure that it gets to the person,\" he explains.\nMore like this:\n• Why urban sketching retreats are taking off\n• The quiet travel solution to a noisy world\n• Is it time to change how we buy travel souvenirs?\nDespite the challenges, McGibbon has sent thousands in her lifetime with no plans to stop. \"It's maybe not the smartest financial decision long-term, because the cost of stamps keeps going up, but it's an investment in relationships.\"\nWhile writing and sending postcards may no longer be the way humans most communicate while travelling, Girardin believes that they still have a future, especially among people who appreciate what they stand for: \"What people were doing in the past and what they're doing now, yes, it's different. But it's also the same: we're trying to describe a moment of discovery whilst travelling and share it with people\".\nIt would take nearly six weeks for my friend in North Carolina to receive my Thai postcard, by which point my message was a distant memory, surprising and delighting us both, like developing film from an old camera. Writing postcards reminds me to be more intentional with my time and my loved ones when I travel. And that will always beat an Instagram photo.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 8,
      "title": "BBC Travel's favourite stories of 2025",
      "link": "https://www.bbc.com/travel/article/20251218-bbc-travels-favourite-stories-of-2025",
      "content": "From biking across vineyard-dotted hills in Europe to witnessing one of the world's most breathtaking lakes in Pakistan, these are the 10 stories we couldn't stop talking about this year.\nA great travel story can change the way we see the world. It can transport us to places we've never been, reveal new sides to places we think we know and inspire us to care about people and cultures that we previously didn't know existed.\nEvery year, we publish hundreds of awe-inspiring, immersive travel articles from around the globe. These are the 10 that we couldn't stop talking about this year – the ones that moved us, transformed us and reminded us how wonderfully diverse the world can be. From a bay where travellers can walk on the ocean floor to a US town that runs on horsepower, we hope you enjoy reading these stories as much as we did.\n\"One of the great joys of reading BBC Travel stories for me is learning about places I thought I knew something about – and this story is a great example of that. Who would have known that in the midst of the 'car capital of the world', there's a tiny time capsule of an island home to 600 horses, no cars and the only highway in the US where it's illegal to drive? This place seems weird, whimsical and wonderful.\" – Eliot Stein\n\"This piece does exactly what great travel journalism should: it takes a place the internet flattens into a single image and restores all the complexity behind it. I appreciate the careful and textured reporting, which anchors the story in the lives of the displaced communities – not just the intensely blue lake that later went viral. The result is an important story that threads geology, grief, resilience and tourism together, and trusts the reader with all of it.\" – Ellie Cobb\n\"One of the biggest news stories of 2025 was the election of a new pope, and this very timely World's Table story was one of our most-loved reads of the year. And with good reason; this elegantly written piece examines an ancient, mysterious tradition through a human lens. So, what do they eat? Hint: nothing stuffed.\" – Eva Sandoval\n\"This town in Arizona has a James Beard-nominated Mexican restaurant, candle-making and ceramics studios, a bike shop and a sustainable clothing store stitched together by walking and bike paths between its densely packed, bright-white homes. There are doctors, markets, even train access, but no four-wheelers in sight. As architect Daniel Parolek says, it's about being 'car free, but mobility rich'. The piece doesn't just highlight a cool place to visit, but an enticing way to live.\" – Laura Norkin\n\"I love stories that illuminate lesser-known American history, and this one does exactly that. The piece not only made me want to visit Locke but also inspired me to read up on Asian American history in the American West. This piece is a beautifully written reminder of the diversity that makes the US really interesting.\" – Lynn Brown\n\"This is just fantastic travel writing, plain and simple. It's terrifically well-researched and reported, it's deeply engaging and it transports me to the Bay of Fundy's dramatic tides. I can feel the bay's towering sea stacks, sense its glistening hanks of kelp and smell its saline tang. Gorgeous kicker, too. If you've ever wanted to be a travel journalist, give this a read.\" – Eliot Stein\n\"What I love about this is the simplicity of the premise paired with the sophistication of the execution. The writer turns a border-crossing bike path into a vivid story about the joy of travelling at human speed. It's useful without ever feeling like service, and shows that sustainable travel stories can be ambitious without feeling didactic. Reading it makes you want to lace up, hop on a bike and rethink what a 'European break' can be.\" – Ellie Cobb\n\"First of all, a piece of buttered toast covered in sprinkles isn't a sandwich by anyone's definition – and the joyful quirkiness of this story (and snack) only begins there. The fact that Dutch businessmen belly up to tables to enjoy this during a work lunch made me laugh, but reading that more than 15 million kgs of the stuff is consumed annually means I probably hadn't been taking hagelslag seriously enough. It is, according to this piece, emblematic of a Dutch way of being. 'They're not over-analysing this, thinking: Is this healthy? Is this for children? They're just indulging in a relatively simple pleasure.' That makes perfect sense to me.\" – Laura Norkin\n\"Have you wondered what happens to lost luggage at the airport? The answer is unspooled in this tale about a visit to Unclaimed Baggage in Scottsboro, Alabama, a city-block-sized repository filled with everything from wedding dresses to functioning electronics to medieval armour. The prose bounces back-and-forth between the mythical and the mundane – the thought of collections of Cartier, Louis Vuitton and Gucci items sitting patiently in a storehouse in the Appalachian foothills sounds almost preposterous. And yet that's the joy of the piece; it transports you to a world where the ordinary can become extraordinary.\" – Francis Agustin\n\"Workshops selling strappy leather sandals made while you wait are so common a sight in Athens that they seem to repeat in the background, like a glitch in the Matrix. I loved how this article forces the traveller to slow down and really look at those colourful souvenirs, perhaps as if for the first time, and see the centuries of artisanry behind them.\" – Eva Sandoval\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    },
    {
      "id": 9,
      "title": "How a single meme can jeopardise your trip",
      "link": "https://www.bbc.com/travel/article/20251217-how-a-single-meme-can-jeopardise-your-trip",
      "content": "Social media posts deemed dangerous or offensive can increasingly lead to visa denial or online backlash. Here's what global travellers need to know.\nLast week, the US government announced plans to scrutinise five years' worth of social media posts by visitors from dozens of countries who are eligible to visit the US for 90 days without a visa. While the specific details of the proposal remain unclear, the American public has several weeks to submit comments responding to the plan before it takes effect on 8 February 2026. Among other information, ESTA visa-free applicants will need to provide all email addresses used over the past 10 years.\nThe proposal reflects a recent trend of increased scrutiny of visitors to the US, where travellers' digital footprints may now be used as grounds to bar them from entering or to deport them from the country. Earlier this year, a Norwegian tourist claimed he was denied entry to the US after officials searched his phone and found a meme of Vice President JD Vance. US Customs and Border Patrol (CBP) denies the claim, stating that the decision was because of the Norwegian's \"admitted drug use\". The CBP site notes that \"border searches of electronic devices are often integral to determining an individual's intentions upon entry to the United States\".\nSince returning to the White House in January, President Donald Trump has sought to secure the US's borders, citing national security reasons. But some experts say the new plan could pose an additional obstacle that deters would-be travellers.\nDonald Rothwell, a law professor at Australian National University and regular commentator on international legal issues, is one of many who are now cautious of travelling to the US, as he says the visitor experience is becoming increasingly fraught.\n\"Currently, under the Visa Waiver Program, which allows visitors from 42 countries to enter the US using the ESTA process, they possess very little rights at the border,\" he cautions.\n\"This partly arises because in applying under the Visa Waiver Program, [visitors] waive some of their US legal rights to contest certain decisions made by US CBP [Customs and Border Protection] at the border. So, if on arrival at a US border a foreign visitor fails to comply with a CBP border official request, they can be denied entry.\" His advice for visitors: be highly cautious about what you post online with respect to matters that may relate to US policy or individual Americans.\nLooking further ahead, Rothwell theorises that increasing digitisation is likely to make high levels of scrutiny far more common – and easier to implement: \"If travel is going to become 'borderless', it follows that more digital data will be collected on travellers.\" More data, he adds, provides authorities greater confidence that the visitor does not pose a security threat. \"I suspect that we will see an increasing use of AI being used to make these decisions,\" he says.\nThe US is far from the only nation to implement such surveillance measures. Governments around the world are increasingly monitoring travellers' social media activity, and a person's digital footprint can still cause problems long after they cross a border. In 2018, New Zealand introduced what they said was the world's first law allowing border officials to demand access to travellers' phones, with hefty fines for those who refuse to share their passwords. The United Arab Emirates goes further still: authorities can detain foreigners who post or even repost defamatory content, as one Irishman discovered last year when he left a negative online review of a former local employer.\nThe risks are also rising because travellers are generating ever-increasing volumes of potentially sensitive content. A survey of British travellers by Virgin Mobile found that more than half \"can't imagine not taking pictures on holiday\", typically uploading seven images a week to social media. In the arms race of \"travel porn\", many users get competitive. One-in-10 survey respondents said they would go to extreme lengths for a holiday selfie, including standing on a cliff edge or posing with wild animals.\nThe problem is that those shots are often taken without regard for local norms, leading to backlash that can quickly escalate. In 2022, a Russian influencer and her husband were deported from Bali after staging a nude photoshoot under a sacred tree. Shortly after the photos were uploaded to social media, local politician Niluh Djelantic asked fellow citizens to report the influencer to the police. \"She should be responsible for the cost of the cleaning ceremony to be carried out by villagers,\" Djelantik wrote. \"Trashy tourist. Go home!\"\nIncidents like this have led to governments scrambling to educate their globe-trotting citizens, with web pages dedicated to ever-shifting social media etiquette abroad, or cultural norms that many travellers may not realise exist. Canada's government portal , for example, warns that in Thailand it is illegal to promote alcohol consumption, and you can be fined for posting pictures with alcohol on social media.\nSucheta Rawal, a travel keynote speaker and children's book author , has experienced how quickly a holiday post can spiral. On a trip to Africa last year, one of her posts was viewed by a contact, who then angrily reshared it globally. \"I didn't feel I was being insensitive,\" she says, \"but it led to misinterpretation, blame and hostility towards me, which made the rest of my trip very difficult. All content is vulnerable – whether you are posting personally or privately. In today's environment, it is not very difficult to take comments out of context, or to thread them into stories that you did not intend to be told.\"\nAt a time when more travellers are becoming content creators and posting gigabytes of material every month, the scope for misunderstanding grows. \"When I was writing Beato Goes to Japan,\" says Rawal, \"I realised that I had to be mindful of so many subtle cultural nuances in my images.\" The wrapping of a yukata (summer kimono) differs between living people and corpses, she notes, while facing your back to a torii gate, the entrance to a Shinto shrine, is disrespectful.\nMore like this:\n• Where are all the Canadians going?\n• The new tourist fines sweeping Europe\n• The perils of letting AI plan your next trip\nAs travel photography becomes increasingly performative, millions of people take selfies wearing local clothing or visiting religious shrines. Such missteps can offend those nearby long before an image is posted online.\nOften, it is unfamiliarity with cultural norms – rather than malice – that lies behind these incidents. For example, Japan, along with many Asian and Middle Eastern nations, is an example of a \" high-context society \". In a talk on the subject, intercultural communication expert Erin Meyer explains that in such cultures, communication \"is more implicit, or layered or nuanced\", and much is said through symbolic gestures or implied understanding.\nTravellers from \"low-context societies\", which prioritise direct verbal communication, may find such layered, understated communication a minefield of potential rudeness – one where even if you avoid words, you don't necessarily avoid causing offence. When social posts today come with the option of adding a plethora of emojis, a simple video upload at a foreign fruit market, with an accompanying watermelon icon could easily trigger viewers who see that as a sign of antisemitism or a racist stereotype against black Americans.\nNone of this means holidaymakers should censor themselves entirely for fear of backlash. Instead, the best approach may be to simply post more consciously, prioritising quality over quantity rather than feeding algorithms or expectations.\n\"Awareness is often gained by being fully aware and present of your surroundings,\" says Rawal. \"Observe how people around you dress, speak, act, and try to blend in as best as you can. Don't turn local people into objects just because you are a traveller.\"\nThe result is not just a safer and more meaningful trip, but one where you connect respectfully with cultural sites rather than simply turning them into content.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram ."
    }
  ]
}